{
    "html_content": "<!DOCTYPE html>\n<html lang=\"en\">\n <head>\n  <meta charset=\"utf-8\"/>\n  <meta content=\"width=device-width, initial-scale=1\" name=\"viewport\"/>\n  <link crossorigin=\"anonymous\" href=\"https://cdn.jsdelivr.net/npm/bootstrap@5.0.0-beta1/dist/css/bootstrap.min.css\" integrity=\"sha384-giJF6kkoqNQ00vy+HMDP7azOuL0xtbfIcaT9wjKHr8RbDVddVHyTfAAsrekwKmP1\" rel=\"stylesheet\"/>\n  <link href=\"style.css\" rel=\"stylesheet\"/>\n  <title>\n   XGROUP\n  </title>\n </head>\n <body>\n  <nav class=\"bottom-nav\">\n  </nav>\n  <div class=\"container\">\n   <div class=\"row justify-content-center\">\n    <div class=\"col-md-8 mt-5\">\n     <div class=\"alert text-white bg-hacker-card mb-2 mt-2\">\n      <b>\n       VERY IMPORTANT\n      </b>\n      In this text, we are going to explain you how our service works. Read it carefully, ask your doubts if you have any or if you don't understand a specific spot, and DO NOT place an order without have read, understood and agreed the Rules and Procedures at all. We are serious people and we demand the same from our potential clients.\n     </div>\n     <div class=\"card bg-hacker-card\">\n      <div class=\"card-header\">\n       <h3 class=\"text-white\">\n        SMARTPHONE HACKING\n       </h3>\n      </div>\n      <div class=\"card-body\">\n       <p class=\"text-white\">\n        <b>\n         RULES AND PROCEDURES:\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         This service consists of invading a mobile device (cell phone or tablet) and take any or all of the data inside of it. Our service is done by using the carrier's network. When we say \"carrier\" we mean to the company who provides voice and data services. The company with which the device's owner has its contract. Each device has a SIM card, and through this SIM card, the device is in constant connection with the carrier that provides its services. What we do is to use the carrier's network, since this network will always be linked to the device, even if the person has no active plan at this time, or if the line is cut. As long as the SIM card remains in the device, there will be a satellite connection, which we will use as a bridge, to attack the carrier and use its network to invade the device.\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         2. The price of our service varies according to the data you want to get from the device. We have 3 packages, which we detail below:\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         • Basic Package - 500 US Dollars - It will allow you to spy up to 2 (two) messaging apps at your choice (for example: Whatsapp, Messenger, Telegram, etc.). And if you want to spy more than 2 apps, you can do it by paying an extra 25 dollars for each additional app.\n        </b>\n        <br/>\n        <b>\n         • Full Social Package - 700 US Dollars - It will allow you to spy all the messaging apps that the device has installed, in addition to SMS sent and received, call log and audio calls.\n        </b>\n        <br/>\n        <b>\n         • Complete Package - 900 US Dollars - Full access to the entire device. Conversations from all installed messaging apps, calling logs and audios, SMS sent and received, photos and videos taken with the camera, real time GPS location, possibility to activate the camera to spy in real time, all the passwords stored in the device from emails and social networks, dating apps logs (Tinder, Happn, Badoo, etc.). It will be like having the device itself in your hands to see it completely.\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         3. If you want to invade more than one device, you will have a discount of 10%, however, you should know that EVERYTHING must be paid in ONE PAYMENT. If you want the service for more than one device but pay one by one, then place your order in this same way.\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         4. We will delay from 5 to 15 hours to invade the carrier's network, depending of the queued orders before yours. a. There is available an Express Service with an extra cost of 50 dollars. It will grant you priority over other orders and reduce the waiting time to the half.\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         5. All the information for the contracted package can be viewed from a private area on this website, to which we will give you access at the end of the service. In addition, you can download what you want to your computer or phone and schedule automatic sending of reports to your email.\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         6. The Basic and Full Social packages will receive updates every day at midnight. At this time, all new conversations and logs of that day will be sent to our server and can be viewed. If you hired, instead, the Complete package, the updates will be in real time and you will be able to see and spy everything at the same time it is happening.\n        </b>\n        <br/>\n        <b>\n         a. You will receive data updates for a period of 6 months. It is possible to extend and renew this time before its expiration. If it expires and has not been renewed, the service must be contracted and paid again. The renewal price is 50 US Dollars per each 6 months, but if you pay it together with the service payment, it will cost 30 US Dollars\n        </b>\n        <br/>\n        <b>\n         b. Any information that has been deleted from the device prior to the device's invasion can not be recovered. However, once invaded, even if the information is deleted, you can also view it.\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         7. The service is compatible with all type of devices, mobile phones and tablets. Regardless of its brand and/or model.\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         8. Payment must be sent through Bitcoin or Monero. - There is no other payment method. Please understand and don't insist.\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         9. We accept intermediaries. It means that if you want to be an intermediary between us and another person, it is possible; however, you must understand that our treat is with you, and even if you are just an intermediary, you are the only responsible to fulfill all Rules and Procedures, and to pay for our service. If you don't want to be absolutely responsible, just don't accept to be intermediary.\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white\">\n        <b>\n         10. Once you place an order, we don't accept any modification or cancellation. If you are not sure about our service, DO NOT order anything yet. a. Be carefully at the moment to send us the target number. If you send an incorrect number, you must also pay, because the mistake will have been yours.\n        </b>\n        <br/>\n       </p>\n       <p class=\"text-white mb-5\">\n        <b>\n         11. Our Rules and Procedures are not flexible If you want to place an order with us, you must accept all without modify, add, or remove anything.\n        </b>\n        <br/>\n        <b>\n         a. Remember that you are not committed with us yet, but if you place an order, we will have a contract, and you must fulfill it mandatorily.\n        </b>\n        <br/>\n        <b>\n         b. Not to read or misunderstand the rules is not justification for not fulfill them.\n        </b>\n       </p>\n       <h4 class=\"text-white\">\n        HOW TO PLACE AN ORDER?\n       </h4>\n       <p class=\"text-white\">\n        <b>\n         Have you read our Rules and Procedures? Do you accept it at all? If yes, you can do this as follows:\n        </b>\n        <b>\n         <span style=\"color: #ffffff;\">\n          <b>\n           <span style=\"color: #ffffff;\">\n            <a href=\"http://hsawibvb3j6tuscjcslebgqwuvjnh72g62w5sklc6x3hfwvpa3zm7aid.onion/\" style=\"color: #ffffff;\" target=\"_blank\">\n             xgroup@tormail.pro\n            </a>\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n            <br/>\n           </span>\n          </b>\n         </span>\n        </b>\n       </p>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n  <nav class=\"navbar fixed-bottom navbar-expand-sm navbar-dark bg-hacker\">\n   <div class=\"container-fluid\">\n    <button aria-controls=\"navbarCollapse\" aria-expanded=\"false\" aria-label=\"Toggle navigation\" class=\"navbar-toggler\" data-bs-target=\"#navbarCollapse\" data-bs-toggle=\"collapse\" type=\"button\">\n     <span class=\"navbar-toggler-icon\">\n     </span>\n    </button>\n    <div class=\"collapse navbar-collapse\" id=\"navbarCollapse\">\n     <ul class=\"navbar-nav\">\n      <li class=\"nav-item active\">\n       <a aria-current=\"page\" class=\"nav-link\" href=\"index.php\">\n        Home\n       </a>\n      </li>\n      <li class=\"nav-item dropup\">\n       <a aria-expanded=\"false\" class=\"nav-link dropdown-toggle\" data-bs-toggle=\"dropdown\" href=\"#\" id=\"dropdown10\">\n        Hacking Services\n       </a>\n       <ul aria-labelledby=\"dropdown10\" class=\"dropdown-menu bg-hacker-dark\">\n        <li>\n         <a class=\"dropdown-item\" href=\"covid-19.php\">\n          COVID-19 VACCINE\n         </a>\n        </li>\n        <li>\n         <a class=\"dropdown-item\" href=\"email-hacking.php\">\n          Email Hacking\n         </a>\n        </li>\n        <li>\n         <a class=\"dropdown-item\" href=\"social-accounts.php\">\n          Social Accounts\n         </a>\n        </li>\n        <li>\n         <a class=\"dropdown-item\" href=\"smartphones-hacking.php\">\n          Smartphones Hacking\n         </a>\n        </li>\n        <li>\n         <a class=\"dropdown-item\" href=\"grades-hacking.php\">\n          Grades Hacking\n         </a>\n        </li>\n        <li>\n         <a class=\"dropdown-item\" href=\"website-hacking.php\">\n          Website Hacking\n         </a>\n        </li>\n        <li>\n         <a class=\"dropdown-item\" href=\"ip-tracking.php\">\n          IP Tracking\n         </a>\n        </li>\n        <li>\n         <a class=\"dropdown-item\" href=\"debt-clearing.php\">\n          Debt Clearing\n         </a>\n        </li>\n        <li>\n         <a class=\"dropdown-item\" href=\"others.php\">\n          <i class=\"fa fa-user-plus\">\n          </i>\n          Custom Service\n         </a>\n        </li>\n       </ul>\n      </li>\n      <li class=\"nav-item\">\n       <a class=\"nav-link\" href=\"contact.php\">\n        Contact\n       </a>\n      </li>\n      <li class=\"nav-item\">\n       <a class=\"nav-link\" href=\"become.php\">\n        Join Us\n       </a>\n      </li>\n     </ul>\n    </div>\n   </div>\n  </nav>\n  <script crossorigin=\"anonymous\" integrity=\"sha384-ygbV9kiqUc6oa4msXn9868pTtWMgiQaeYH7/t7LECLbyPA2x65Kgf80OJFdroafW\" src=\"https://cdn.jsdelivr.net/npm/bootstrap@5.0.0-beta1/dist/js/bootstrap.bundle.min.js\">\n  </script>\n </body>\n</html>\n"
}