{
    "html_content": "<!DOCTYPE html>\n<html lang=\"en\">\n <head>\n  <meta charset=\"utf-8\"/>\n  <meta content=\"width=device-width, initial-scale=1\" name=\"viewport\"/>\n  <title>\n   Tor + OpenVPN\n  </title>\n  <link href=\"../general.css\" rel=\"stylesheet\" type=\"text/css\"/>\n </head>\n <body>\n  <div id=\"header\">\n   <div class=\"content\">\n    <h2>\n     <a href=\"/\">\n      Oil and Fish\n     </a>\n    </h2>\n   </div>\n  </div>\n  <div id=\"main\">\n   <div class=\"content\">\n    <h1>\n     Tor + OpenVPN\n    </h1>\n    <p>\n     In the solution we describe in this article:\n    </p>\n    <ul>\n     <li>\n      We collect all the computer’s network traffic by installing a virtual private network (VPN) client.\n     </li>\n     <li>\n      We pass our traffic through Tor before it gets to the OpenVPN server by defining Tor as a SOCKS proxy to the OpenVPN client.\n     </li>\n     <li>\n      To overcome domestic blocking of Tor, we use a bridge.\n     </li>\n    </ul>\n    <p>\n     This solution has the additional advantage that your exit node will be a VPN server, and not an obvious Tor server. This can be useful if you visit websites that block or impede Tor users.\n    </p>\n    <p>\n     The client in our examples runs Windows 10.\n    </p>\n    <h2>\n     <a id=\"1\">\n     </a>\n     1. Create VPN Account\n    </h2>\n    <p>\n     You need a VPN provider so that you can connect to a VPN server after passing through Tor. Some privacy-focused providers you might consider are\n     <a href=\"https://www.ivpn.net\" target=\"_blank\">\n      IVPN\n     </a>\n     ,\n     <a href=\"https://mullvad.net\" target=\"_blank\">\n      Mullvad\n     </a>\n     , and\n     <a href=\"https://airvpn.org/\" target=\"_blank\">\n      AirVPN\n     </a>\n     . These are only possibilities, and not necessarily recommendations. You will need to look for a provider:\n    </p>\n    <ul>\n     <li>\n      who offers TCP servers\n     </li>\n     <li>\n      who allows you to connect to their servers from Tor nodes\n     </li>\n     <li>\n      whose payment methods are accessible from your country\n     </li>\n    </ul>\n    <p>\n     As you search for a suitable VPN provider, beware of affiliate pages posing as reviews. Also be skeptical of claims not to keep logs. In the past, at least one provider turned out to be dishonest in this respect. And watch out for\n     <a href=\"https://www.zdnet.com/article/many-free-mobile-vpn-apps-are-based-in-china-or-have-chinese-ownership\" target=\"_blank\">\n      free VPNs based in mainland China\n     </a>\n     which are under the control of the Chinese Communist Party.\n    </p>\n    <h2>\n     <a id=\"2\">\n     </a>\n     2. Install Tor Browser\n    </h2>\n    <p>\n     In many countries, you can download Tor Browser from\n     <a href=\"https://www.torproject.org/download/languages\" target=\"_blank\">\n      www.torproject.org\n     </a>\n     .\n    </p>\n    <p>\n     Some countries block the domain\n     <code>\n      www.torproject.org\n     </code>\n     , making it difficult for netizens to get a copy of Tor Browser. The\n     <strong>\n      GetTor\n     </strong>\n     service can help these users. Simply send an email to\n     <a href=\"mailto:gettor@torproject.org\">\n      gettor@torproject.org\n     </a>\n     . It will automatically respond with alternative download links for Tor Browser. These download links point to GitHub, GitLab, the Internet Archive, and Google Drive. At least one of these hosting providers should be accessible from any country. For example, users from China can download Tor Browser from the Tor Project’s GitHub mirror.\n    </p>\n    <p>\n     At the time of writing, the installer\n     <code>\n      .exe\n     </code>\n     file is about 64 MB. Once you have downloaded it, run the installer to install Tor Browser on your PC.\n    </p>\n    <p>\n     Do not connect directly, though. First, we need to configure Tor to use a bridge. We do this in the next step.\n    </p>\n    <h2>\n     <a id=\"3\">\n     </a>\n     3. Configure Tor\n    </h2>\n    <p>\n     In countries where you cannot directly connect to the Tor network, you need to use bridges. Bridges are unlisted Tor relays and, depending on the bridge type, they can obfuscate network traffic in a way that’s more difficult for censors to detect.\n    </p>\n    <p>\n     The simplest method of censorship circumvention in Tor Browser is to use the built-in bridges — a set of a dozen bridges that come with Tor Browser. These bridges are essentially public, which is why more aggresive censorship systems (such as China’s Great Firewall) block them. But they are still effective in many countries, e.g. Iran.\n    </p>\n    <ol>\n     <li>\n      Launch Tor Browser for the first time.\n     </li>\n     <li>\n      Click\n      <strong>\n       Configure\n      </strong>\n      .\n     </li>\n     <li>\n      Select\n      <strong>\n       Tor is censored in my country\n      </strong>\n      .\n     </li>\n     <li>\n      Choose\n      <strong>\n       Select a built-in bridge\n      </strong>\n      .\n     </li>\n     <li>\n      From the dropdown list, select\n      <strong>\n       obfs4\n      </strong>\n      .\n     </li>\n     <li>\n      Now you can click\n      <strong>\n       Connect\n      </strong>\n      .\n     </li>\n    </ol>\n    <p>\n     If you need alternative bridges, use a Gmail account to email\n     <a href=\"mailto:bridges@torproject.org\">\n      bridges@torproject.org\n     </a>\n     . Leave the subject line blank and write\n     <code>\n      get transport obfs4\n     </code>\n     in the body of the email.\n    </p>\n    <p>\n     Note that in China you will probably have to use\n     <strong>\n      meek-azure\n     </strong>\n     instead of\n     <strong>\n      obfs4\n     </strong>\n     . If your version of Tor Browser offers\n     <strong>\n      snowflake\n     </strong>\n     , that may also work.\n    </p>\n    <p>\n     One you have connected, visit\n     <a href=\"https://check.torproject.org\" target=\"_blank\">\n      check.torproject.org\n     </a>\n     to confirm that you are connecting through Tor. You should see the text: “Congratulations. This browser is configured to use Tor.”\n    </p>\n    <h2>\n     <a id=\"4\">\n     </a>\n     4. Download OpenVPN Client\n    </h2>\n    <p>\n     Some VPN providers offer their own client software as an alternative to the standard OpenVPN client. In this scenario, we need to use the standard OpenVPN client.\n    </p>\n    <p>\n     Using your regular browser, download the 64-bit Microsoft Installer (MSI) for Windows 10 from the\n     <a href=\"https://openvpn.net/community-downloads\" target=\"_blank\">\n      OpenVPN website\n     </a>\n     .\n    </p>\n    <p>\n     Once you have downloaded it, run the\n     <code>\n      .msi\n     </code>\n     installer to install the OpenVPN client on your computer.\n    </p>\n    <p>\n     At the end, it displays a message to say that there are no connection profiles (i.e. configuration files) yet. This is okay. Just press\n     <strong>\n      OK\n     </strong>\n     .\n    </p>\n    <h2>\n     <a id=\"5\">\n     </a>\n     5. Download OpenVPN Configuration File\n    </h2>\n    <p>\n     OpenVPN can use either UDP or TCP protocol, but Tor can only handle TCP. For our scenario, we must therefore use TCP.\n    </p>\n    <p>\n     Choose a location from among those offered by your VPN provider. This will be your exit node after you have passed through Tor.\n    </p>\n    <p>\n     Download your VPN provider’s configuration file for your chosen location and for protocol TCP. It will have a name that ends in\n     <code>\n      .ovpn\n     </code>\n     .\n    </p>\n    <h2>\n     <a id=\"6\">\n     </a>\n     6. Edit OpenVPN Configuration File\n    </h2>\n    <p>\n     In the windows search box, type\n     <code>\n      notepad\n     </code>\n     . Open the Notepad built-in app. Edit the\n     <code>\n      .ovpn\n     </code>\n     file you just downloaded. We are going to insert a new line that looks like this:\n    </p>\n    <blockquote>\n     <code>\n      socks-proxy\n      <em>\n       server\n      </em>\n      [\n      <em>\n       port\n      </em>\n      ]\n     </code>\n    </blockquote>\n    <p>\n     This tells the OpenVPN client to connect to the VPN server via a SOCKS5 proxy at address\n     <code>\n      <em>\n       server\n      </em>\n     </code>\n     and port\n     <code>\n      <em>\n       port\n      </em>\n     </code>\n     .\n    </p>\n    <p>\n     The Tor client that comes with Tor Browser listens on localhost port\n     <code>\n      9150\n     </code>\n     . Therefore the line you actually insert will be:\n    </p>\n    <blockquote>\n     <code>\n      socks-proxy 127.0.0.1 9150\n     </code>\n    </blockquote>\n    <p>\n     Do\n     <strong>\n      File\n     </strong>\n     &gt;\n     <strong>\n      Save\n     </strong>\n     to save the file. Close Notepad.\n    </p>\n    <h2>\n     <a id=\"7\">\n     </a>\n     7. End-to-End Test\n    </h2>\n    <p>\n     If you have not already done so, start Tor Browser, but minimize it. This keeps Tor listening on port 9150.\n    </p>\n    <p>\n     Find the OpenVPN GUI from the icon in the system tray. Right-click on the icon to bring up the OpenVPN menu.\n    </p>\n    <p>\n     Select\n     <strong>\n      Import file\n     </strong>\n     , find your edited\n     <code>\n      .ovpn\n     </code>\n     configuration file, and open it. After the file is imported successfully, click\n     <strong>\n      OK\n     </strong>\n     .\n    </p>\n    <p>\n     Again, bring up the OpenVPN menu from the system tray. Now there are more options. Select the menu option\n     <strong>\n      Connect\n     </strong>\n     to connect to your OpenVPN server.\n    </p>\n    <p>\n     Enter your username and password for your VPN provider. Check the option to save your password. Click\n     <strong>\n      OK\n     </strong>\n     .\n    </p>\n    <p>\n     Open your regular browser and visit\n     <a href=\"https://ipchicken.com\" target=\"_blank\">\n      IPchicken.com\n     </a>\n     . You should see the IP address of your provider’s OpenVPN server, not your local client IP address. Your request has reached the OpenVPN server via Tor, using a bridge to reach the Tor network.\n    </p>\n    <h2>\n     <a id=\"8\">\n     </a>\n     8. Note for Linux Clients\n    </h2>\n    <p>\n     As stated in the introduction, this post is for Windows 10 users. If you want to adapt it for Linux, you will need to look at your routing table:\n    </p>\n    <blockquote>\n     <code>\n      sudo route -n\n     </code>\n    </blockquote>\n    <p>\n     It may be that starting OpenVPN with the\n     <code>\n      socks-proxy\n     </code>\n     option has caused OpenVPN to add an extra entry for destination\n     <code>\n      127.0.0.1\n     </code>\n     . This makes sense with an external SOCKS proxy, but not with an internal SOCKS proxy. Therefore you should delete this route:\n    </p>\n    <blockquote>\n     <code>\n      sudo route del -net 127.0.0.1 gw G.G.G.G netmask 255.255.255.255\n     </code>\n    </blockquote>\n    <p>\n     where\n     <code>\n      G.G.G.G\n     </code>\n     is your default gateway.\n    </p>\n    <p>\n     You also need to tell the routing to reach your Tor entry node outside of the VPN:\n    </p>\n    <blockquote>\n     <code>\n      sudo route add -net E.E.E.E netmask 255.255.255.255 gw G.G.G.G\n     </code>\n    </blockquote>\n    <p>\n     where\n     <code>\n      E.E.E.E\n     </code>\n     is your Tor entry node (either a bridge or a guard node) and\n     <code>\n      G.G.G.G\n     </code>\n     is your default gateway. This will only work if your entry node is relatively static.\n    </p>\n    <p>\n     It should be possible to script these route table changes and invoke them with the OpenVPN\n     <code>\n      route-up\n     </code>\n     option. The corresponding option when taking down the VPN is\n     <code>\n      route-pre-down\n     </code>\n     . Neither of these possibilities has been tested.\n    </p>\n    <h2>\n     <a id=\"9\">\n     </a>\n     9. Get Help and Report Issues\n    </h2>\n    <p>\n     Some avenues to get help and report issues:\n    </p>\n    <ul>\n     <li>\n      <a href=\"https://tor.stackexchange.com\" target=\"_blank\">\n       Tor on Stack Exchange\n      </a>\n     </li>\n     <li>\n      <a href=\"https://www.reddit.com/r/TOR\" target=\"_blank\">\n       Tor on Reddit\n      </a>\n     </li>\n     <li>\n      <a href=\"https://forums.openvpn.net\" target=\"_blank\">\n       OpenVPN forums\n      </a>\n     </li>\n    </ul>\n    <p>\n     <em>\n      Updated 2021-06-19\n     </em>\n    </p>\n   </div>\n  </div>\n  <div id=\"footer\">\n   <div class=\"content\">\n    <p>\n     This site is provided for information only. It cannot replace the advice of a trained security professional. If lives or safety depend on your security, please seek the advice of an expert.\n    </p>\n   </div>\n  </div>\n </body>\n</html>\n"
}