{
    "html_content": "<!DOCTYPE html>\n<html lang=\"en\">\n <head>\n  <meta charset=\"utf-8\"/>\n  <meta content=\"width=device-width, initial-scale=1\" name=\"viewport\"/>\n  <title>\n   Introduction to Tor Browser\n  </title>\n  <link href=\"../general.css\" rel=\"stylesheet\" type=\"text/css\"/>\n </head>\n <body>\n  <div id=\"header\">\n   <div class=\"content\">\n    <h2>\n     <a href=\"/\">\n      Oil and Fish\n     </a>\n    </h2>\n   </div>\n  </div>\n  <div id=\"main\">\n   <div class=\"content\">\n    <h1>\n     Introduction to Tor Browser\n    </h1>\n    <p>\n     Tor Browser is\n     <a href=\"tor-not-free-countries.html\">\n      used in not-free countries\n     </a>\n     to circumvent censorship. The Tor network architecture — triple relays and triple encryption — also provides some privacy.\n    </p>\n    <p>\n     The combination of censorship circumvention and privacy attracts negative attention from governments. Many countries block the Tor protocol, Tor servers, and even the Tor Project website. However, techniques have been developed to work around these blocks.\n    </p>\n    <p>\n     This article will introduce you to Tor Browser. Wherever possible, it takes into account the needs of users behind government firewalls.\n    </p>\n    <p>\n     This article is mainly for users of the Tor Browser on their regular operating system. Parts of it will also apply to users of Tails or\n     <a href=\"practical-anonymity-political-religious-dissidents.html\">\n      Whonix.\n      <p>\n      </p>\n      <h2>\n      </h2>\n     </a>\n     <a id=\"1\">\n     </a>\n     1. Download Tor Browser\n    </p>\n    <h3>\n     <a id=\"1-1\">\n     </a>\n     1.1. Download\n    </h3>\n    <p>\n     First you need to download the Tor Browser installer. Official installers are available for Windows, macOS, Linux, and Android.\n    </p>\n    <p>\n     If you can reach the official Tor Project website, you can download Tor Browser from the\n     <a href=\"https://www.torproject.org/download\" target=\"_blank\">\n      download page\n     </a>\n     . Windows, macOS, and Linux installers are also available in 32 languages from the\n     <a href=\"https://www.torproject.org/download/languages\" target=\"_blank\">\n      download languages page\n     </a>\n     . The installers vary in size from around 70 to 80 MB.\n    </p>\n    <p>\n    </p>\n    <p>\n     If you cannot reach the Tor Project website, the GetTor service can help. Send an email to\n     <a href=\"mailto:gettor@torproject.org\">\n      gettor@torproject.org\n     </a>\n     . It will automatically respond with alternative download links. At least one of the alternative hosting providers should be accessible in each country.\n    </p>\n    <p>\n     Due to iOS technical limitations, there is no official Tor Browser for iOS. There is, though, an unofficial app named\n     <a href=\"https://onionbrowser.com\" target=\"_blank\">\n      Onion Browser\n     </a>\n     for iOS.\n    </p>\n    <p>\n     Do not run the installer just yet. We have some preparatory work to do.\n    </p>\n    <h3>\n     <a id=\"1-2\">\n     </a>\n     1.2. Optionally Verify Download on Linux\n    </h3>\n    <p>\n     If you are on Linux, you can optionally verify your Tor browser download as follows.\n    </p>\n    <p>\n     Firstly, when you download the Tor Browser installer, also download the signature file that goes with your Tor Browser installer. It has a name that matches the main download, except that it ends in\n     <code>\n      .asc\n     </code>\n     .\n    </p>\n    <p>\n     Automatically locate the Tor Browser signing key:\n    </p>\n    <blockquote>\n     <code>\n      gpg --auto-key-locate nodefault,wkd --locate-keys torbrowser@torproject.org\n     </code>\n    </blockquote>\n    <p>\n     The results should mention the key\n     <code>\n      4E2C6E8793298290\n     </code>\n     along with a message,\n     <code>\n      public key \"Tor Browser Developers (signing key) &lt;torbrowser@torproject.org&gt;\" imported\n     </code>\n     . Export this key to a keyring file:\n    </p>\n    <blockquote>\n     <code>\n      gpg --output ./tor.keyring --export 0xEF6E286DDA85EA2A4BA7DE684E2C6E8793298290\n     </code>\n    </blockquote>\n    <p>\n     Now verify, using the keyring file you just created, the signature of the download:\n    </p>\n    <blockquote>\n     <code>\n      gpgv --keyring ./tor.keyring tor-browser-linux64-10.0_en-US.tar.xz.asc tor-browser-linux64-10.0_en-US.tar.xz\n     </code>\n    </blockquote>\n    <p>\n     You should see a message,\n     <code>\n      Good signature from \"Tor Browser Developers (signing key) &lt;torbrowser@torproject.org&gt;\"\n     </code>\n     .\n    </p>\n    <h2>\n     <a id=\"2\">\n     </a>\n     2. Get Tor Bridges\n    </h2>\n    <h3>\n     <a id=\"2-1\">\n     </a>\n     2.1. Need for Bridges\n    </h3>\n    <p>\n     Many countries block the IP addresses of Tor relays or use deep packet inspection (DPI) to detect and block the Tor protocol.\n    </p>\n    <p>\n     If your country is one of the ones that blocks direct connections to the Tor network, you may need to use a bridge. Bridges can obfuscate Tor network traffic, making it more difficult for censors to detect.\n    </p>\n    <h3>\n     <a id=\"2-2\">\n     </a>\n     2.2. Types of Bridges\n    </h3>\n    <p>\n     There are three main types of Tor bridge:\n    </p>\n    <ul>\n     <li>\n      <strong>\n       Obfs4\n      </strong>\n      bridges work in most countries. They may be public or private.\n      <ul>\n       <li>\n        Public bridges can either be built-in to the Tor Browser, or obtained from the public bridge database (BridgeDB).\n       </li>\n       <li>\n        Private bridges are ones you or a friend create and choose not list in BridgeDB.\n       </li>\n      </ul>\n     </li>\n     <li>\n      <strong>\n       Meek-azure\n      </strong>\n      uses a completely different obfuscation technique called domain-fronting. Meek-azure is slow but works in China.\n     </li>\n     <li>\n      <strong>\n       Snowflake\n      </strong>\n      is a new type of bridge, available in some versions of Tor Browser.\n     </li>\n    </ul>\n    <h3>\n     <a id=\"2-3\">\n     </a>\n     2.3. Bridge Lines\n    </h3>\n    <p>\n     The most common type of bridges, obfs4, are defined to the Tor Browser by bridge lines. A bridge line looks like this:\n    </p>\n    <blockquote>\n     <code>\n      Bridge obfs4 11.11.11.11:2222 B6740861AE06B247f55CB63EA347E248F72CCE08 cert=YjY3NDA4NjFhZTA2YjI0N2Y1NWNiNjNlYTM0N2UyNDhmNzJjY2UwODMzOTg2NGM3N2NjMW iat-mode=0\n     </code>\n    </blockquote>\n    <p>\n     The above is a completely fabricated example and not a real bridge line.\n     <code>\n      11.11.11.11\n     </code>\n     represents an IP address,\n     <code>\n      2222\n     </code>\n     represents a port number, and\n     <code>\n      B6740861AE06B247f55CB63EA347E248F72CCE08\n     </code>\n     is a made-up fingerprint.\n    </p>\n    <h3>\n     <a id=\"2-4\">\n     </a>\n     2.4. Get Bridges\n    </h3>\n    <p>\n     Tor Browser comes with a dozen or so built-in obfs4 bridges. In countries that block Tor IP addresses, you may need to obtain additional obfs4 bridges.\n    </p>\n    <ul>\n     <li>\n      You can get more bridges from the\n      <a href=\"https://bridges.torproject.org/options\" target=\"_blank\">\n       official Tor Project site\n      </a>\n      . Unobfuscated bridges, also known as vanilla bridges, may work in some environments. If you want these, click\n      <strong>\n       Just give me bridges\n      </strong>\n      on that page. Otherwise, scroll down to\n      <strong>\n       Advanced Options\n      </strong>\n      , select\n      <strong>\n       obfs4\n      </strong>\n      , and click\n      <strong>\n       Get Bridges\n      </strong>\n      .\n     </li>\n     <li>\n      You can also get more bridges by email. From a Gmail account, send an email to\n      <a href=\"mailto:bridges@torproject.org\">\n       bridges@torproject.org\n      </a>\n      . Leave the email subject empty, and write\n      <code>\n       get transport obfs4\n      </code>\n      in the email’s message body.\n     </li>\n     <li>\n      From within Tor Browser. See\n      <strong>\n       Request a bridge from torproject.org\n      </strong>\n      in\n      <a href=\"#4-2\">\n       section 4.2\n      </a>\n      .\n     </li>\n     <li>\n      There is an unofficial Telegram channel for bridge distribution at\n      <a href=\"https://t.me/tor_bridges\" target=\"_blank\">\n       t.me/tor_bridges\n      </a>\n      .\n     </li>\n    </ul>\n    <h3>\n     <a id=\"2-5\">\n     </a>\n     2.5. Test Bridge Reachability\n    </h3>\n    <p>\n     Before you try to use your bridges, you may want to test their reachability. You can attempt to\n     <code>\n      ping\n     </code>\n     the bridge IP address. Using our sample bridge line from above, the command would be:\n    </p>\n    <blockquote>\n     <code>\n      ping 11.11.11.11\n     </code>\n    </blockquote>\n    <p>\n     This method is not guaranteed to be accurate, since reachability by ICMP and reachability by TCP are two separate things, especially if you are faced with a sophisticated firewall. In any case, the node may have deliberately blocked ICMP requests.\n    </p>\n    <p>\n     The other thing you can do is to look up the bridge on the\n     <a href=\"https://metrics.torproject.org/rs.html\" target=\"_blank\">\n      Tor Project relay search page\n     </a>\n     . To maintain the secrecy of bridge IP addresses, you cannot search by IP address. However, you can enter the 40-digit fingerprint. This comes after the bridge IP address and port in the bridge line. Using the same example of a bridge line, the fingerprint to search for would be:\n    </p>\n    <blockquote>\n     <code>\n      B6740861AE06B247f55CB63EA347E248F72CCE08\n     </code>\n    </blockquote>\n    <p>\n     This is a made-up fingerprint, so do not actually try to search for this example.\n    </p>\n    <h2>\n     <a id=\"3\">\n     </a>\n     3. Install Tor Browser\n    </h2>\n    <p>\n     At this point, you have the Tor Browser installer and, if necessary, a list of reachable bridges. Now you are ready to install Tor Browser.\n    </p>\n    <p>\n     On Windows, macOS, and Android, just follow the normal procedure to install an app on your platform. On Linux, open a terminal window and issue these commands:\n    </p>\n    <blockquote>\n     <code>\n      cd ~/Downloads\n     </code>\n    </blockquote>\n    <blockquote>\n     <code>\n      ls\n     </code>\n    </blockquote>\n    <p>\n     You should see your downloaded installer. It will have a name that looks like\n     <code>\n      tor-browser-linux64-10.0_en-US.tar.xz\n     </code>\n     . The version number and language may be different when you try this.\n    </p>\n    <p>\n     In recent versions of Linux, you should be able to extract Tor Browser directly from the\n     <code>\n      xz\n     </code>\n     file:\n    </p>\n    <blockquote>\n     <code>\n      tar -xf tor-browser-linux64-10.0_en-US.tar.xz\n     </code>\n    </blockquote>\n    <p>\n     Change into the extracted directory:\n    </p>\n    <blockquote>\n     <code>\n      cd tor-browser_en-US\n     </code>\n    </blockquote>\n    <p>\n     Register the Tor Browser app:\n    </p>\n    <blockquote>\n     <code>\n      ./start-tor-browser.desktop --register-app\n     </code>\n    </blockquote>\n    <p>\n     Close your terminal. Assuming you are using a Linux distribution that comes with GNOME desktop, click\n     <strong>\n      Activities\n     </strong>\n     , and search for Tor Browser. Click the icon to launch Tor Browser.\n    </p>\n    <p>\n     Once you have launched Tor Browser, you can if you wish click\n     <strong>\n      Activities\n     </strong>\n     again, right-click on the Tor Browser icon in the dash, and select\n     <strong>\n      Add to Favorites\n     </strong>\n     so that it stays in the dash permanently.\n    </p>\n    <img alt=\"Adding Tor Browser to Favorites in GNOME dash on Linux\" src=\"../images/tor-browser-1.png\"/>\n    <h2>\n     <a id=\"4\">\n     </a>\n     4. Connect or Configure\n    </h2>\n    <h3>\n     <a id=\"4-1\">\n     </a>\n     4.1. Direct Connection\n    </h3>\n    <p>\n     The first time you launch Tor Browser on a desktop or laptop computer, you are presented with an initial screen. This offers you the option to connect directly to the Tor network, or to configure Tor Browser before you connect.\n    </p>\n    <p>\n     If Tor is not blocked in your country, you can just click\n     <strong>\n      Connect\n     </strong>\n     . A status bar appears, showing Tor’s connection progress. You can skip the rest of this section.\n    </p>\n    <p>\n     If Tor is blocked, you must click\n     <strong>\n      Configure\n     </strong>\n     . That will take you to further options.\n    </p>\n    <h3>\n     <a id=\"4-2\">\n     </a>\n     4.2. If Tor is Censored in Your Country\n    </h3>\n    <p>\n     On the\n     <strong>\n      Settings\n     </strong>\n     &gt;\n     <strong>\n      Connection\n     </strong>\n     screen, under\n     <strong>\n      Bridges\n     </strong>\n     , you will see three choices:\n    </p>\n    <ul>\n     <li>\n      <strong>\n       Choose from one of Tor Browser’s built-in bridges\n      </strong>\n      . This is where you can use a built-in bridge of type obfs4, meek-azure, or snowflake if available.\n     </li>\n     <li>\n      <strong>\n       Request a bridge from torproject.org\n      </strong>\n      . This option is another way to get bridge lines. It uses domain fronting so should be accessible in most countries. This bridge distribution mechanism is also referred to as Moat.\n     </li>\n     <li>\n      <strong>\n       Enter a bridge address you already know\n      </strong>\n      . Select this option if you have already obtained some bridges, either public ones from BridgeDB or private ones you or a friend set up.\n     </li>\n    </ul>\n    <img alt=\"Choose the way a bridge will be provided\" src=\"../images/tor-browser-2.png\"/>\n    <h3>\n     <a id=\"4-3\">\n     </a>\n     4.3. If You Use a Proxy to Connect to the Internet\n    </h3>\n    <p>\n     Under\n     <strong>\n      Advanced\n     </strong>\n     , on the line\n     <strong>\n      Configure how Tor Browser connects to the internet\n     </strong>\n     , click the\n     <strong>\n      Settings\n     </strong>\n     button.\n    </p>\n    <p>\n     Check the box saying you use a proxy to connect to the Internet. You can then specify a pre-proxy. For example, you may have\n     <a href=\"shadowsocks-libev.html\">\n      Shadowsocks\n     </a>\n     or\n     <a href=\"v2ray.html\">\n      V2Ray\n     </a>\n     configured to listen on localhost port 1080.\n    </p>\n    <img alt=\"I use a proxy to connect to the Internet\" src=\"../images/tor-browser-3.png\"/>\n    <p>\n     If you do not need a proxy to connect to the Internet, then leave this box unchecked.\n    </p>\n    <h3>\n     <a id=\"4-4\">\n     </a>\n     4.4. Connect\n    </h3>\n    <p>\n     Once you have set up all the options you need, click\n     <strong>\n      Connect\n     </strong>\n     . A status bar appears, showing Tor’s connection progress.\n    </p>\n    <img alt=\"Tor Browser connecting to the Tor network\" src=\"../images/tor-browser-4.png\"/>\n    <p>\n     If there is a problem and you need to look at the Tor logs, go to\n     <strong>\n      Settings\n     </strong>\n     &gt;\n     <strong>\n      Connection\n     </strong>\n     &gt;\n     <strong>\n      Advanced\n     </strong>\n     . Click\n     <strong>\n      View Logs\n     </strong>\n     . The log may or may not be informative. After copying the log to the clipboard, paste the log into a text editor such as Windows Notepad or Linux Gedit.\n    </p>\n    <h3>\n     <a id=\"4-5\">\n     </a>\n     4.5. Connection Assist\n    </h3>\n    <p>\n     A new feature automates the process of getting bridges and connecting to the Tor network. It is now present in the production Tor Browser.\n    </p>\n    <p>\n     Connection Assist tries to detect whether or not Tor is blocked in your location. This may take a couple of minutes. The feature will then attempt to automatically find a working means of connecting. This may take another couple of minutes.\n    </p>\n    <p>\n     Connection Assist works by looking up and downloading an up-to-date list of country-specific options to try using your location (with your consent). It manages to do so without needing to connect to the Tor Network by utilizing “moat” — the same domain-fronting tool that Tor Browser uses to request a bridge from the Tor Project website.\n    </p>\n    <h2>\n     <a id=\"5\">\n     </a>\n     5. Guided Tour of Tor Browser\n    </h2>\n    <h3>\n     <a id=\"5-1\">\n     </a>\n     5.1. Letterboxing\n    </h3>\n    <p>\n     The first thing you may notice after you connect is that the display size has been rounded to nearest 100 pixels horizontally and vertically. Letterboxing appears around the margins of the display. This is designed to protect your anonymity by making you look like many other users.\n    </p>\n    <p>\n     The usual advice is not to maximize your browser window, as this could give away your monitor size. This may apply less nowadays, since many people have common monitor sizes. In any case, your main concern may be bypassing censorship rather than complete anonymity and blending in with the crowd.\n    </p>\n    <h3>\n     <a id=\"5-2\">\n     </a>\n     5.2. Check Connection\n    </h3>\n    <p>\n     Check your connection to the Tor network by visiting\n     <a href=\"https://check.torproject.org\" target=\"_blank\">\n      check.torproject.org\n     </a>\n     . You should see a headline:\n     <code>\n      Congratulations. This browser is configured to use Tor.\n     </code>\n    </p>\n    <h3>\n     <a id=\"5-3\">\n     </a>\n     5.3. Display Circuit Information\n    </h3>\n    <p>\n     Click the padlock icon to display the Tor circuit by which you reached this site.\n    </p>\n    <img alt=\"Displaying Tor circuit information in Tor Browser\" src=\"../images/tor-browser-5.png\"/>\n    <p>\n     At the bottom of the circuit information panel is a button,\n     <strong>\n      New Circuit for this Site\n     </strong>\n     . Pressing this button will give you a new Tor circuit to reach the current site, including a new exit node. This can be useful if a particular website blocks the Tor exit node you were using.\n    </p>\n    <h3>\n     <a id=\"5-4\">\n     </a>\n     5.4. Display Security Level\n    </h3>\n    <p>\n     Click the shield icon to see your current security level.\n    </p>\n    <img alt=\"Displaying Tor Browser security level\" src=\"../images/tor-browser-6.png\"/>\n    <p>\n     If you want to change your security level, click\n     <strong>\n      Change\n     </strong>\n     . You can select from three levels:\n    </p>\n    <ul>\n     <li>\n      <strong>\n       Standard\n      </strong>\n      . All features, including JavaScript, are enabled.\n     </li>\n     <li>\n      <strong>\n       Safer\n      </strong>\n      . JavaScript is enabled only for HTTPS sites. Some fonts and math symbols are disabled. Audio and video are click-to-play.\n     </li>\n     <li>\n      <strong>\n       Safest\n      </strong>\n      . JavaScript is disabled on all sites. Some fonts, icons, math symbols, and images are disabled. Audio and video are click-to-play.\n     </li>\n    </ul>\n    <h3>\n     <a id=\"5-5\">\n     </a>\n     5.5. Display Add-ons\n    </h3>\n    <p>\n     Click the hamburger menu, then select\n     <strong>\n      Add-ons and themes\n     </strong>\n     . You will see the Tor Browser comes with\n     <strong>\n      NoScript\n     </strong>\n     . This allows JavaScript only from trusted domains.\n    </p>\n    <h3>\n     <a id=\"5-6\">\n     </a>\n     5.6. Customize Tor Browser\n    </h3>\n    <p>\n     The icon for NoScript does not appear in your browser by default. To see it, you must customize the browser.\n    </p>\n    <p>\n     Click the hamburger menu, then\n     <strong>\n      More Tools\n     </strong>\n     , then\n     <strong>\n      Customize toolbar\n     </strong>\n     . Drag the icon for NoScript into the toolbar.\n    </p>\n    <img alt=\"NoScript icon in Tor Browser toolbar\" src=\"../images/tor-browser-7.png\"/>\n    <p>\n     When you have finished customizing, close the\n     <strong>\n      Customize Tor Browser\n     </strong>\n     tab.\n    </p>\n    <h3>\n     <a id=\"5-7\">\n     </a>\n     5.7. Reset Identity\n    </h3>\n    <p>\n     Click the paintbrush icon to reset your identity. All open tabs and windows will be closed. All private information, such as cookies and browsing history, will be cleared. New Tor circuits will be built. This makes you look like a completely new user.\n    </p>\n    <h3>\n     <a id=\"5-8\">\n     </a>\n     5.8. Reconfigure Network Settings\n    </h3>\n    <p>\n     When you started Tor Browser for the first time, you made some choices about bridges and a proxy server. You can change these settings at any time. Click the hamburger icon, select\n     <strong>\n      Settings\n     </strong>\n     , then select the\n     <strong>\n      Connection\n     </strong>\n     tab. Alternatively, you can directly put\n     <code>\n      about:preferences#connection\n     </code>\n     in the URL box.\n    </p>\n    <img alt=\"Tor Browser preferences for Tor settings\" src=\"../images/tor-browser-8.png\"/>\n    <h2>\n     <a id=\"6\">\n     </a>\n     6. Disable JavaScript\n    </h2>\n    <p>\n     JavaScript can be used to extract information about your computer and to trick you into installing malware. For this reason, some users like to disable JavaScript. If you do this, you will see that some sites do not render without JavaScript. You will have to make some personal choices as to how much JavaScript you will allow. By default, Tor Browser allows JavaScript everywhere. This is to avoid confusing new users.\n    </p>\n    <p>\n     There are three ways to disable JavaScript in Tor Browser:\n    </p>\n    <ul>\n     <li>\n      Set the Tor Browser security level to\n      <strong>\n       Safest\n      </strong>\n      , which disables JavaScript everywhere.\n     </li>\n     <li>\n      Select the NoScript icon that you placed in the toolbar. Click the options icon. On the\n      <strong>\n       General\n      </strong>\n      tab, set the\n      <strong>\n       DEFAULT\n      </strong>\n      to disallow JavaScript. Optionally, set per-site permissions to allow JavaScript from domains you trust.\n     </li>\n     <li>\n      As a failsafe, you can disable JavaScript at the browser level. Visit\n      <code>\n       about:config\n      </code>\n      , search for\n      <code>\n       javascript.enabled\n      </code>\n      , and toggle its value to\n      <strong>\n       false\n      </strong>\n      .\n     </li>\n    </ul>\n    <h2>\n     <a id=\"7\">\n     </a>\n     7. Torrc File\n    </h2>\n    <h3>\n     <a id=\"7-1\">\n     </a>\n     7.1. Location of Torrc\n    </h3>\n    <p>\n     A file named\n     <code>\n      torrc\n     </code>\n     controls how Tor behaves. The default\n     <code>\n      torrc\n     </code>\n     generated by Tor Browser should work fine for most users. To find out where your\n     <code>\n      torrc\n     </code>\n     file is:\n    </p>\n    <ul>\n     <li>\n      On Windows or Linux, look in a location such as\n      <code>\n       ~/Downloads/tor-browser_en-US/Browser/TorBrowser/Data/Tor\n      </code>\n     </li>\n     <li>\n      On macOS, look in a location such as\n      <code>\n       ~/Library/Application Support/TorBrowser-Data/Tor\n      </code>\n      .\n     </li>\n    </ul>\n    <h3>\n     <a id=\"7-2\">\n     </a>\n     7.2. Example Torrc\n    </h3>\n    <p>\n     Here is a sample\n     <code>\n      torrc\n     </code>\n     file. The real bridge lines have been replaced by a fake bridge line from our example earlier on.\n    </p>\n    <blockquote>\n     <code>\n      # This file was generated by Tor; if you edit it, comments will not be preserved\n      <br/>\n      # The old torrc file was renamed to torrc.orig.1 or similar, and Tor will ignore it\n      <br/>\n      <br/>\n      Bridge obfs4 11.11.11.11:2222 B6740861AE06B247f55CB63EA347E248F72CCE08 cert=YjY3NDA4NjFhZTA2YjI0N2Y1NWNiNjNlYTM0N2UyNDhmNzJjY2UwODMzOTg2NGM3N2NjMW iat-mode=0\n      <br/>\n      ClientOnionAuthDir /home/username/Downloads/tor-browser_en-US/Browser/TorBrowser/Data/Tor/onion-auth\n      <br/>\n      DataDirectory /home/username/Downloads/tor-browser_en-US/Browser/TorBrowser/Data/Tor\n      <br/>\n      GeoIPFile /home/username/Downloads/tor-browser_en-US/Browser/TorBrowser/Data/Tor/geoip\n      <br/>\n      GeoIPv6File /home/username/Downloads/tor-browser_en-US/Browser/TorBrowser/Data/Tor/geoip6\n      <br/>\n      UseBridges 1\n     </code>\n    </blockquote>\n    <h3>\n     <a id=\"7-3\">\n     </a>\n     7.3. Country Codes\n    </h3>\n    <p>\n     You can exclude certain countries from the nodes in your circuit by putting an\n     <code>\n      ExcludeNodes\n     </code>\n     directive in your\n     <code>\n      torrc\n     </code>\n     file. Use the\n     <a href=\"https://www.iso.org/iso-3166-country-codes.html\" target=\"_blank\">\n      ISO 3166\n     </a>\n     two-character codes to specify countries. For example:\n    </p>\n    <blockquote>\n     <code>\n      ExcludeNodes {cn},{hk},{mo},{by},{ru},{ir}\n     </code>\n    </blockquote>\n    <p>\n     Note that there may not be many nodes in the countries you specify. Also, specifying a unique combination of countries makes you less anonymous, since your requests through the Tor network no longer looks like everyone else’s.\n    </p>\n    <p>\n     You can restrict the country of your exit node with the\n     <code>\n      ExitNodes\n     </code>\n     directive. For example:\n    </p>\n    <blockquote>\n     <code>\n      ExitNodes {us}\n     </code>\n    </blockquote>\n    <p>\n     Again, you will need to choose a country that has many exit nodes for this to work, and even so, you still make yourself less anonymous.\n    </p>\n    <p>\n     To enforce your node rules, even if this breaks your ability to construct a Tor circuit, add a directive:\n    </p>\n    <blockquote>\n     <code>\n      StrictNodes 1\n     </code>\n    </blockquote>\n    <p>\n     You need to restart Tor Browser after editing your\n     <code>\n      torrc\n     </code>\n     file.\n    </p>\n    <h2>\n     <a id=\"8\">\n     </a>\n     8. Get Help and Report Issues\n    </h2>\n    <p>\n     Here are some ways you can get support if you encounter problems with Tor Browser:\n    </p>\n    <ul>\n     <li>\n      You can ask informal questions on social media such as\n      <a href=\"https://www.reddit.com/r/TOR\" target=\"_blank\">\n       Reddit\n      </a>\n      or\n      <a href=\"https://tor.stackexchange.com\" target=\"_blank\">\n       Stack Exchange\n      </a>\n     </li>\n     <li>\n      You can send an email to\n      <a href=\"mailto:frontdesk@torproject.org\" target=\"_blank\">\n       frontdesk@torproject.org\n      </a>\n     </li>\n     <li>\n      You can browse\n      <a href=\"https://gitlab.torproject.org/tpo/applications/tor-browser/-/issues\" target=\"_blank\">\n       known issues\n      </a>\n     </li>\n     <li>\n      You can join the\n      <code>\n       #tor\n      </code>\n      channel of the\n      <a href=\"https://webchat.oftc.net/\" target=\"_blank\">\n       Open and Free Technology Community\n      </a>\n      Internet Relay Chat (IRC)\n     </li>\n    </ul>\n    <p>\n     <em>\n      Updated 2022-07-11\n     </em>\n    </p>\n   </div>\n  </div>\n  <div id=\"footer\">\n   <div class=\"content\">\n    <p>\n     This site is provided for information only. It cannot replace the advice of a trained security professional. If lives or safety depend on your security, please seek the advice of an expert.\n    </p>\n   </div>\n  </div>\n </body>\n</html>\n"
}