{
    "html_content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<rss version=\"2.0\" xmlns:content=\"http://purl.org/rss/1.0/modules/content/\">\n <channel>\n  <title>\n   The Proton Blog\n  </title>\n  <description>\n   News from the front lines of privacy and security\n  </description>\n  <link/>\n  https://proton.me/blog/\n  <language>\n   en\n  </language>\n  <feed_url>\n   https://proton.me/blog/feed\n  </feed_url>\n  <item>\n   <title>\n    What is data sovereignty and why does it matter for your business?\n   </title>\n   <link/>\n   https://proton.me/blog/data-sovereignty\n   <guid ispermalink=\"true\">\n    https://proton.me/blog/data-sovereignty\n   </guid>\n   <description>\n    This article will explain data sovereignty, why it matters, and how it can be achieved to not only protect you, but your business.\n   </description>\n   <pubdate>\n    Fri, 12 Jul 2024 22:13:34 GMT\n   </pubdate>\n   <content:encoded>\n    &lt;p&gt;People and companies are generally subject to the laws of the country and city where they are located, and those laws can change when they move to a new place. However, the situation becomes more complicated when considering data, which can be subject to multiple jurisdictions depending on where it is collected, processed, and stored.&lt;/p&gt;\n\n\n\n&lt;p&gt;If you live in France, for example, and a US tech company stores your data in servers located in California, which laws are relevant to your most valuable information?&lt;/p&gt;\n\n\n\n&lt;p&gt;The answer to that question is becoming more important every day, as more and more people interact with products, apps, and programs from all over the globe. The central principle of&lt;strong&gt; data sovereignty &lt;/strong&gt;is that&lt;strong&gt; data should be subject to the laws of the country where it was generated and collected&lt;/strong&gt;.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;As the ongoing saga over how &lt;a href=\"https://noyb.eu/en/european-commission-gives-eu-us-data-transfers-third-round-cjeu\"&gt;Meta processes Europeans’ data&lt;/a&gt;  demonstrates, however,&amp;nbsp;this concept is being challenged. How data sovereignty is applied — or not — to your data will have a lasting impact on the internet as a whole.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;This article will explain the concept, why it matters, and how it can be achieved so your business remains secure and compliant with the strictest of data sovereignty regulations. &lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;a href=\"#what-is\"&gt;What is data sovereignty?&lt;/a&gt;&lt;/strong&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;&lt;a href=\"#which-laws\"&gt;Which laws apply to my data?&amp;nbsp;&lt;/a&gt;&lt;/strong&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;&lt;a href=\"#who-opposes\"&gt;Who opposes data sovereignty?&lt;/a&gt;&lt;/strong&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;&lt;a href=\"#why-data\"&gt;Why data sovereignty matters: The Meta case&lt;/a&gt;&lt;/strong&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;&lt;a href=\"#best-practices\"&gt;Best practices for your business&lt;/a&gt;&lt;/strong&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;&lt;a href=\"#proton\"&gt;Proton’s approach&lt;/a&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"what-is\"&gt;What is data sovereignty?&lt;/h2&gt;\n\n\n\n&lt;p&gt;Many people tend to think of data as an abstract concept, a nebulous collection of personal data points that exists in space that is ill-defined. In reality, however, there are concrete statements we can make about most data to better understand where it is being stored:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Your data comes with fairly exact metadata:&lt;/strong&gt; This information can pinpoint when and where it was collected, which format it is encoded in, and an identifier linked to the person or device where it originated&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Data is always stored somewhere in the physical world:&lt;/strong&gt; This information occupies a well-defined physical space, measured in bytes on a computer or server.&amp;nbsp;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;A large portion of data comes from your devices:&lt;/strong&gt; It may be no surprise that &lt;a href=\"https://www.weforum.org/agenda/2023/04/charted-there-are-more-phones-than-people-in-the-world/\"&gt;there are more mobile phones in the world than people&lt;/a&gt;. That’s why data generation and collection tend to start on your device before it is sent to another location — such as &lt;a href=\"https://proton.me/blog/what-is-the-cloud\"&gt;the cloud&lt;/a&gt; or remote servers — to be processed and stored.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;All that data is often generated in one country and stored in another, which raises an important question.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\" id=\"which-laws\"&gt;Which laws apply to my data?&lt;/h3&gt;\n\n\n\n&lt;p&gt;This is where &lt;strong&gt;data sovereignty&lt;/strong&gt; enters the picture. Data sovereignty is &lt;strong&gt;the concept that it doesn’t matter where the data is stored — the laws that should govern data are the laws of the country where the data was generated and collected.&amp;nbsp;&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n\n\n\n&lt;p&gt;This makes intuitive sense. These are the same laws that also govern, in most cases, the person who generated the data. Why would it be different for their data?&lt;/p&gt;\n\n\n\n&lt;p&gt;The immediate consequence of data sovereignty for a company that collects and stores people’s data, however, is that it must adopt data governance policies and technical measures to ensure the legal protections governing that data are respected and implemented.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\" id=\"who-opposes\"&gt;Who opposes data sovereignty? &lt;/h3&gt;\n\n\n\n&lt;p&gt;Some of the staunchest critics of data sovereignty are  cloud storage providers. Their business model depends on selling cold storage, computing power, or whole backend infrastructures to companies.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;Their physical servers are often located in countries outside their client&amp;#8217;s jurisdiction — or they might reside in the same country as the client company while the cloud provider is headquartered in a different country.&lt;/p&gt;\n\n\n\n&lt;p&gt;If data sovereignty is enforced, these companies must meet new obligations, which can increase their overhead and complicate their workflows.&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"why-data\"&gt;Why data sovereignty matters: The Meta case&lt;/h2&gt;\n\n\n\n&lt;p&gt;Meta’s attempts to collect and process the data of people in the European Union and resulting lawsuits perfectly demonstrate the idea of data sovereignty.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;In 2023, the EU &lt;a href=\"https://apnews.com/article/meta-facebook-data-privacy-fine-europe-9aa912200226c3d53aa293dca8968f84\"&gt;fined Meta a record $1.3 billion&lt;/a&gt; in a &lt;a href=\"https://apnews.com/article/data-privacy-europe-business-government-surveillance-technology-32cd88d05897f31e5b4d1bcd3d1ade83\"&gt;decadeslong court case&lt;/a&gt; and ordered it to cease sending users’ personal data across the Atlantic.&lt;/p&gt;\n\n\n\n&lt;p&gt;In a nutshell: Meta transferred all the data it collects from EU countries to its servers in the US so that it could process it and use it to sell ads. Thanks to data sovereignty protections in the &lt;a href=\"https://gdpr.eu/what-is-gdpr/\"&gt;GDPR&lt;/a&gt;, all data that is collected from people in the EU must be processed and stored within the EU. &lt;/p&gt;\n\n\n\n&lt;p&gt;Max Schrems, founder of the &lt;a href=\"https://noyb.eu/en\"&gt;European Center for Digital Rights&lt;/a&gt; (NOYB), argued that Meta and the &lt;a href=\"https://noyb.eu/en/eu-us-data-transfers-0\"&gt;US government do not meet the GDPR’s standard of protection&lt;/a&gt;, as it &lt;a href=\"https://proton.me/blog/us-warrantless-surveillance\"&gt;implements mass surveillance programs&lt;/a&gt; and has the ability to force US companies to share information they’ve collected.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;The Court of Justice of the European Union agreed, and the litigation has shifted to finding an appropriate solution. None of this would be possible, however, if it weren&amp;#8217;t for the principle of data sovereignty. If data collected in the EU no longer fell within the parameters of EU law, Schrems and NOYB would not have been able to make a strong case, much less win.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"best-practices\"&gt;Best practices for your business&lt;/h2&gt;\n\n\n\n&lt;p&gt;If you run a small business, having all your storage and computation needs fulfilled by an on-premise infrastructure — and therefore not relying on any contractor servers — is a possible way of achieving data sovereignty.&lt;/p&gt;\n\n\n\n&lt;p&gt;This is hardly cost-effective and efficient, however, for many businesses, especially smaller ones. Here are some alternative solutions and other best practices to consider:&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Conduct a data audit:&lt;/strong&gt; Regularly assess where and how your data is stored and processed. This is a vital step that companies often overlook. Understanding the flow of data inside your organization can help identify potential compliance issues and areas where there is room for improvement.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Use end-to-end encrypted email services&lt;/strong&gt;: Ensure that all data communication methods and storage solutions use end-to-end encryption. This provides a robust layer of security, protecting data both at rest and in transit. Proton, for example, offers a comprehensive range of services that deploys both &lt;a href=\"https://proton.me/blog/what-is-end-to-end-encryption\"&gt;end-to-end encryption&lt;/a&gt; and &lt;a href=\"https://proton.me/blog/zero-access-encryption\"&gt;zero-access encryption&lt;/a&gt; to allow you to remain compliant and secure. When you use &lt;a href=\"https://proton.me/mail\"&gt;Proton Mail&lt;/a&gt;, your messages are automatically end-to-end encrypted — you don’t need to do anything.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Use a privacy-first cloud provider:&lt;/strong&gt; Choose cloud service providers that prioritize privacy and comply with data sovereignty laws. &lt;a href=\"https://proton.me/drive\"&gt;Proton Drive&lt;/a&gt;, for example, can support businesses in meeting those requirements. End-to-end encryption and the protections of Swiss privacy laws will ensure your data is secure and shielded from unauthorized access.&lt;/li&gt;\n&lt;/ol&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"proton\"&gt;Proton’s approach&lt;/h2&gt;\n\n\n\n&lt;p&gt;When you team up with Proton, you are protecting your business data so that no one, not even Proton, can access it. The keys to your most valuable information will remain in your possession at all times, ensuring your data meets the strictest data sovereignty regulations.&lt;/p&gt;\n\n\n\n&lt;p&gt;Proton started as a crowdfunded project led by scientists who met at CERN (the European Organization for Nuclear Research). Our goal is to reshape the internet to put people and organizations in control of their data.&lt;/p&gt;\n\n\n\n&lt;p&gt;Switching to Proton Mail is simple with our&amp;nbsp;&lt;a href=\"https://proton.me/easyswitch\"&gt;Easy Switch&lt;/a&gt;&amp;nbsp;feature, allowing you to seamlessly transition all your emails, contacts, and calendars from other services.&lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://proton.me/mail\"&gt;Proton Mail&lt;/a&gt;, our end-to-end encrypted email, and &lt;a href=\"https://proton.me/drive\"&gt;Proton Drive&lt;/a&gt;, our end-to-end encrypted cloud storage service, make it easy to meet data protection and privacy requirements.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;Discover how Proton can make compliance simple for your organization by &lt;a href=\"https://proton.me/business/plans\"&gt;signing up for Proton for Business&lt;/a&gt; or &lt;a href=\"https://proton.me/business/contact\"&gt;emailing our Partner Success team&lt;/a&gt;.&lt;/p&gt;\n   </content:encoded>\n   <category>\n    For business\n   </category>\n   <author>\n    Edward Komenda\n   </author>\n  </item>\n  <item>\n   <title>\n    Is your data safe from Google Docs AI scraping?\n   </title>\n   <link/>\n   https://proton.me/blog/google-docs-ai-scraping\n   <guid ispermalink=\"true\">\n    https://proton.me/blog/google-docs-ai-scraping\n   </guid>\n   <description>\n    Find out how to use AI in Google Docs and how to prevent your data from being used for AI training.\n   </description>\n   <pubdate>\n    Fri, 12 Jul 2024 15:49:38 GMT\n   </pubdate>\n   <content:encoded>\n    &lt;p&gt;Your online data is no longer just used for ads but also for &lt;a href=\"https://proton.me/blog/privacy-and-chatgpt\"&gt;training AI&lt;/a&gt;. Google uses publicly available information to train its AI models, raising concerns over whether &lt;a href=\"https://proton.me/blog/ai-gdpr\"&gt;AI is even compatible with data protection laws&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;p&gt;People are worried companies are scraping their personal files and data without their consent or outright stealing their copyrighted materials, as highlighted by the &lt;a href=\"https://www.ftc.gov/policy/advocacy-research/tech-at-ftc/2023/10/consumers-are-voicing-concerns-about-ai\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;FTC&lt;/a&gt;. You may begin to wonder whether any of your content is safe — including your writings and other drafts in Google Docs.&lt;/p&gt;\n\n\n\n&lt;p&gt;Currently Google Docs says it does not scrape data for AI training purposes, but the company does scan your data and use it in various other ways. Moreover, its &lt;a href=\"https://policies.google.com/privacy#europeanrequirements\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;privacy policy&lt;/a&gt; doesn’t explicitly rule out the possibility of using your data for AI in the future. &lt;/p&gt;\n\n\n\n&lt;p&gt;This article explores how Google Docs integrates with Gemini, its large language model (LLM), and whether your data is safe from Google Docs AI scraping for training purposes. We also share how to protect your data from being used to train AI and which &lt;a href=\"https://proton.me/drive/docs\"&gt;online document editor&lt;/a&gt; you can use for privacy.&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"#google-docs-ai\"&gt;How Google Docs uses AI&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#google-docs-scraping\"&gt;Is Google Docs scraping your data?&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#docs-in-proton-drive\"&gt;Protect your data from AI training with Docs in Proton Drive&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#defend-your-privacy\"&gt;Proton defends your online privacy&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"google-docs-ai\"&gt;How Google Docs uses AI&lt;/h2&gt;\n\n\n\n&lt;p&gt;Google Docs uses machine learning to offer spelling suggestions, voice typing, comment reply suggestions, and even completing documents (this last feature, Smart Compose, is only available for work or school Google accounts). You can enable or turn off these AI features by clicking &lt;strong&gt;Tools → Preferences&lt;/strong&gt; in a Google Doc.&lt;/p&gt;\n\n\n\n&lt;p&gt;Google also has an AI assistant called Gemini that can handle all types of tasks. It’s currently working on integrating Gemini into Google Docs (if you’re a member of Google Workspace Labs, you can get early access). It goes beyond autocomplete and can be used for suggesting text, improving grammar, providing style recommendations, and even generating or clarifying content ideas.&lt;/p&gt;\n\n\n\n&lt;p&gt;Google’s various AI tools are clearly a big part of Google Docs’ future, which might leave you wondering what this all means for the information in your documents?&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;What is Google Document AI?&lt;/h3&gt;\n\n\n\n&lt;p&gt;A quick clarification — Google also offers Google Document AI, which is an entirely different type of AI feature that allows users to quickly extract data, summarize it, and automate other tedious tasks that involve processing large amounts of documents and PDFs using artificial intelligence. Google specifically &lt;a href=\"https://cloud.google.com/document-ai/docs/security-cmek-logging#data-usage\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;says&lt;/a&gt; it doesn&amp;#8217;t use customer data to train its Document AI models.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"google-docs-scraping\"&gt;Is Google Docs AI scraping your data?&lt;/h2&gt;\n\n\n\n&lt;p&gt;Although Google says it does not use your Google Docs data to train its AI, Google&amp;#8217;s privacy policy doesn&amp;#8217;t explicitly stop the company from using your content and any other publicly available information to train their AI models. Moreover, there’s no easy way to verify that Google’s models don’t use public data since &lt;a href=\"https://opening-up-chatgpt.github.io/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Google doesn’t disclose what data its models use&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;p&gt;Google claims your documents and data are secure when using its AI features, stating that it doesn’t share any part of your document externally. While Google has security protocols in place, including encryption at rest and in transit, it doesn’t support end-to-end encryption, so Google itself has access to your data. Gemini and Google Docs are not open source, so there’s no way to verify the code does what Google claims, which means you’re left with no choice than trusting them to protect your privacy.&lt;/p&gt;\n\n\n\n&lt;p&gt;Additionally, Google Docs allows third-party extensions, which have their own privacy policies and may scrape or share your data. Be sure to check their permissions and privacy policies before granting any outside developers access to your documents.&lt;/p&gt;\n\n\n\n&lt;p&gt;If you want to be completely sure your data is private, the only sure solution is to &lt;a href=\"https://proton.me/blog/how-to-de-google\"&gt;stop using Google services&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;p&gt;Additionally, you should make sure your documents are not set to &lt;strong&gt;Anyone with the link&lt;/strong&gt; can view or edit. If that’s the case then if your document becomes publicly available, the information it contains will likely be used by Google and other AI services for AI training. &lt;/p&gt;\n\n\n\n&lt;p&gt;If you use Gemini, you should know it stores your queries and its outputs by default. However, it does allow you to permanently delete your chats and change its settings to prevent future ones from being stored or used for AI training.&lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://proton.me/blog/what-is-encryption\"&gt;End-to-end encryption&lt;/a&gt; is the best way to protect your content from this. Even if your data is stored, it cannot be read or used for training AI without your explicit permission.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"docs-in-proton-drive\"&gt;Protect your data from AI training with Docs in Proton Drive&lt;/h2&gt;\n\n\n\n&lt;p&gt;Proton Drive now offers Docs, a secure and private alternative to Google Docs for creating and collaborating on online documents. Docs has all the features you expect from an online document editor, enabling you to:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;See the live cursors of your team members and their edits in real time&lt;/li&gt;\n\n\n\n&lt;li&gt;Gather feedback and share ideas with comments&lt;/li&gt;\n\n\n\n&lt;li&gt;Invite anyone to view or edit your docs&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;However, unlike Google Docs and other online document editors, we use &lt;a href=\"https://proton.me/security/end-to-end-encryption\"&gt;end-to-end encryption&lt;/a&gt; to protect your information. With Docs, the documents you create, their version history, any notes you add, and even your keystrokes and cursor movements are all end-to-end encrypted, so they can never be fed into AI models without your permission. Like all Proton services, Docs gives you the keys to access your files so no one — not even Proton — can access them without your consent.&lt;/p&gt;\n\n\n\n&lt;p&gt;Get started with &lt;a href=\"https://proton.me/drive\"&gt;Proton Drive for free&lt;/a&gt; to encrypt your data and protect it from AI training.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Proton defends your online privacy&lt;/h2&gt;\n\n\n\n&lt;p&gt;Unlike Google, Proton doesn&amp;#8217;t profit from your data. Instead, we are exclusively supported by our paying subscribers and primarily &lt;a href=\"https://proton.me/blog/proton-non-profit-foundation\"&gt;owned by a nonprofit&lt;/a&gt; dedicated to promoting online privacy.&lt;/p&gt;\n\n\n\n&lt;p&gt;Since Proton is &lt;a href=\"https://proton.me/blog/switzerland\"&gt;located in Switzerland&lt;/a&gt;, we adhere to some of the world&amp;#8217;s strongest privacy laws. Furthermore, all our apps are &lt;a href=\"https://proton.me/community/open-source\"&gt;open source&lt;/a&gt; and independently audited.&lt;/p&gt;\n\n\n\n&lt;p&gt;By signing up for a Proton account, you gain access to a secure ecosystem that protects all your data, including &lt;a href=\"https://proton.me/drive\"&gt;cloud storage&lt;/a&gt;, &lt;a href=\"https://proton.me/pass\"&gt;passwords&lt;/a&gt;, &lt;a href=\"https://protonvpn.com/?ref=prdmenuvpn\"&gt;internet connection&lt;/a&gt;, &lt;a href=\"https://proton.me/mail\"&gt;email&lt;/a&gt;, and &lt;a href=\"https://proton.me/calendar\"&gt;calendar&lt;/a&gt;.&lt;/p&gt;\n   </content:encoded>\n   <category>\n    Privacy guides\n   </category>\n   <author>\n    Elena Constantinescu\n   </author>\n  </item>\n  <item>\n   <title>\n    How to manage passwords on iPhone and improve your security\n   </title>\n   <link/>\n   https://proton.me/blog/find-delete-passwords-on-iphone\n   <guid ispermalink=\"true\">\n    https://proton.me/blog/find-delete-passwords-on-iphone\n   </guid>\n   <description>\n    Learn how to find, edit, and delete your passwords on iPhone and how to improve your security with an encrypted password manager.\n   </description>\n   <pubdate>\n    Fri, 12 Jul 2024 14:57:39 GMT\n   </pubdate>\n   <content:encoded>\n    &lt;p&gt;iPhone stores passwords in iCloud Keychain, Apple’s built-in password manager. It’s convenient but has &lt;a href=\"https://proton.me/blog/is-icloud-keychain-safe\"&gt;some drawbacks&lt;/a&gt;. A major issue is that it doesn&amp;#8217;t work well with other platforms, making it hard for Apple users to use their passwords and passkeys outside the Apple ecosystem.&lt;/p&gt;\n\n\n\n&lt;p&gt;Additionally, the company &lt;a href=\"https://proton.me/blog/iphone-privacy\"&gt;collects a lot of data&lt;/a&gt; and has been accused of making &lt;a href=\"https://appleinsider.com/articles/23/01/30/fourth-class-action-lawsuit-filed-against-apple-for-alleged-privacy-violations\"&gt;misleading privacy claims&lt;/a&gt;. Apple users concerned about their privacy might want to reconsider relying heavily on Apple products and explore privacy-focused alternatives to better protect their personal information.&lt;/p&gt;\n\n\n\n&lt;p&gt;This article shows how to find passwords on iPhone as well as how to delete them if you’re ready to switch to a privacy-first platform. Not ready to switch completely? We’ll show you how to improve your iCloud Keychain privacy and how easy it is to migrate your data.&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"#find\"&gt;How to find saved passwords on iPhone&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#delete\"&gt;How to delete saved passwords on iPhone&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#autofill\"&gt;How to turn off password autofill on an iPhone&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#icloud-keychain\"&gt;Does iCloud Keychain protect your passwords?&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#password-protection\"&gt;How to improve your password protection on iPhone&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#proton-pass\"&gt;Proton Pass keeps your data safe and private&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"find\"&gt;How to find saved passwords on iPhone&amp;nbsp;&lt;/h2&gt;\n\n\n\n&lt;p&gt;There are three ways to locate passwords on your iPhone: using the Settings app, Spotlight Search, or Siri. Here’s how to use each:&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Using the Settings app&lt;/h3&gt;\n\n\n\n&lt;ol&gt;\n&lt;li&gt;Open the &lt;strong&gt;Settings &lt;/strong&gt;app on your iPhone.&lt;/li&gt;\n\n\n\n&lt;li&gt;Scroll down and, depending on your iOS version, tap &lt;strong&gt;Passwords &lt;/strong&gt;(iOS 14 or later) or &lt;strong&gt;Passwords &amp;amp; Accounts&lt;/strong&gt; (iOS 13 or earlier).&lt;/li&gt;\n\n\n\n&lt;li&gt;Authenticate using Face ID, Touch ID, or your device passcode.&lt;/li&gt;\n\n\n\n&lt;li&gt;You will see a list of websites and apps, so you can tap one to view its saved passwords. You can also use the search bar at the top to quickly find the password you are looking for.&lt;/li&gt;\n&lt;/ol&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Using Spotlight Search&lt;/h3&gt;\n\n\n\n&lt;ol&gt;\n&lt;li&gt;From the Home screen, swipe down from the middle of the screen to access Spotlight Search. Alternatively, you can swipe right on the Home screen until the Spotlight Search bar appears.&lt;/li&gt;\n\n\n\n&lt;li&gt;In the search bar, type &lt;strong&gt;Passwords&lt;/strong&gt; to bring up the &lt;strong&gt;Passwords &lt;/strong&gt;(iOS 14 or later) or &lt;strong&gt;Passwords &amp;amp; Accounts&lt;/strong&gt; (iOS 13 or earlier) section from the Settings app.&lt;/li&gt;\n\n\n\n&lt;li&gt;Follow the remaining steps above.&lt;/li&gt;\n&lt;/ol&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Using Siri&lt;/h3&gt;\n\n\n\n&lt;ol&gt;\n&lt;li&gt;Activate Siri by saying &amp;#8220;Hey Siri&amp;#8221; if you have that feature enabled. Alternatively, press and hold the Home button (on an iPhone that has it) or the Side button (on an iPhone without a Home button).&lt;/li&gt;\n\n\n\n&lt;li&gt;Once Siri is activated, say something like &amp;#8220;Show my passwords&amp;#8221; or &amp;#8220;Open my saved passwords&amp;#8221;. You can also ask Siri to show a specific password by saying something like &amp;#8220;Hey Siri, what&amp;#8217;s my Netflix password?&amp;#8221;&lt;/li&gt;\n\n\n\n&lt;li&gt;Siri will prompt you to authenticate using Face ID, Touch ID, or your device passcode.&lt;/li&gt;\n\n\n\n&lt;li&gt;After authentication, Siri will take you to the &lt;strong&gt;Passwords &lt;/strong&gt;(iOS 14 or later) or &lt;strong&gt;Passwords &amp;amp; Accounts&lt;/strong&gt; (iOS 13 or earlier) section in the Settings app.&lt;/li&gt;\n\n\n\n&lt;li&gt;Follow the remaining steps from the Settings app section above.&lt;/li&gt;\n&lt;/ol&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"delete\"&gt;How to delete saved passwords on iPhone&lt;/h2&gt;\n\n\n\n&lt;p&gt;Follow one of the methods above to reach the &lt;strong&gt;Passwords &lt;/strong&gt;(iOS 14 or later) or &lt;strong&gt;Passwords &amp;amp; Accounts&lt;/strong&gt; (iOS 13 or earlier) section of your Settings app.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Individual passwords&lt;/h3&gt;\n\n\n\n&lt;ol&gt;\n&lt;li&gt;Select a website or app.&lt;/li&gt;\n\n\n\n&lt;li&gt;Tap &lt;strong&gt;Delete Password&lt;/strong&gt; at the bottom of the screen.&lt;/li&gt;\n\n\n\n&lt;li&gt;Confirm the deletion if prompted.&lt;/li&gt;\n&lt;/ol&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Multiple passwords at once&lt;/h3&gt;\n\n\n\n&lt;ol&gt;\n&lt;li&gt;Tap &lt;strong&gt;Edit&lt;/strong&gt; in the top-right corner of the screen.&lt;/li&gt;\n\n\n\n&lt;li&gt;Select the passwords you want to delete by tapping the circle next to each entry.&lt;/li&gt;\n\n\n\n&lt;li&gt;Tap &lt;strong&gt;Delete &lt;/strong&gt;at the bottom of the screen.&lt;/li&gt;\n\n\n\n&lt;li&gt;Confirm the deletion if prompted.&lt;/li&gt;\n&lt;/ol&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"autofill\"&gt;How to turn off password autofill on iPhone&lt;/h2&gt;\n\n\n\n&lt;p&gt;Even if you’ve deleted all your passwords, if you don’t turn off iCloud Keychain’s password autofill feature, it will continue to pop up as an option anytime you try to fill in a password field.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;ol&gt;\n&lt;li&gt;Open the &lt;strong&gt;Settings &lt;/strong&gt;app on your iPhone.&lt;/li&gt;\n\n\n\n&lt;li&gt;Scroll down and, depending on your iOS version, tap &lt;strong&gt;Passwords &lt;/strong&gt;(iOS 14 or later) or &lt;strong&gt;Passwords &amp;amp; Accounts&lt;/strong&gt; (iOS 13 or earlier).&lt;/li&gt;\n\n\n\n&lt;li&gt;Authenticate using Face ID, Touch ID, or your device passcode.&lt;/li&gt;\n\n\n\n&lt;li&gt;Tap &lt;strong&gt;Password Options&lt;/strong&gt;.&lt;/li&gt;\n\n\n\n&lt;li&gt;Tap the toggle switch next to &lt;strong&gt;iCloud Keychain&lt;/strong&gt; to off.&lt;/li&gt;\n&lt;/ol&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"icloud-keychain\"&gt;Does iCloud Keychain protect your passwords?&lt;/h2&gt;\n\n\n\n&lt;p&gt;The iCloud Keychain uses advanced encryption to protect your data, including &lt;a href=\"https://proton.me/blog/what-is-end-to-end-encryption\"&gt;end-to-end encryption&lt;/a&gt; so that no one can see your Keychain data, not even Apple. However, it has some limitations:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Privacy concerns&lt;/strong&gt;: Although iCloud Keychain data is encrypted, &lt;a href=\"https://proton.me/blog/apple-icloud-privacy\"&gt;other iCloud data&lt;/a&gt; (like Mail and Calendar) is not end-to-end encrypted by default, meaning Apple can access this information.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Limited features&lt;/strong&gt;: iCloud Keychain lacks several features found in other password managers, such as the ability to easily share passwords with anyone or store secure notes or custom entries.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Device compatibility&lt;/strong&gt;: iCloud Keychain works best within the Apple ecosystem. It does not integrate well with non-Apple devices like Android phones or Windows laptops.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Passkey interoperability&lt;/strong&gt;: &lt;a href=\"https://proton.me/blog/big-tech-passkey\"&gt;Apple&amp;#8217;s passkeys&lt;/a&gt; mostly work with its own products, making them difficult to use on non-Apple devices — &lt;a href=\"https://proton.me/blog/what-is-a-passkey\"&gt;passkeys&lt;/a&gt; become more secure and user-friendly as more devices use them. Plus, Apple passkeys can’t be shared or exported.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Closed source&lt;/strong&gt;: iCloud Keychain is not open-source, so independent security audits are not possible. You must trust Apple to identify and fix any security vulnerabilities.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"password-protection\"&gt;How to improve your iPhone password protection&lt;/h2&gt;\n\n\n\n&lt;p&gt;Before implementing the steps below, make sure to follow basic &lt;a href=\"https://protonvpn.com/blog/ultimate-guide-iphone-security\"&gt;security practices for your iPhone&lt;/a&gt;. For example, you should keep iOS updated, use Face ID or Touch ID, have a strong device passcode, regularly review app permissions, and only download apps from the App Store.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;1. Use strong, unique passwords&lt;/h3&gt;\n\n\n\n&lt;p&gt;Avoid using easily guessable passwords. Instead, your passwords should be at least 12 characters long, complex (a mix of uppercase and lowercase letters, numbers, and special characters), and unique.&lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://proton.me/pass\"&gt;Proton Pass&lt;/a&gt; can generate strong passwords for you and keep them in a safe place.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;2. Enable two-factor authentication&lt;/h3&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://proton.me/blog/what-is-two-factor-authentication-2fa\"&gt;Two-factor authentication (2FA)&lt;/a&gt; adds an extra layer of security to your Apple ID. Even if someone guesses your password, they would still need to pass a second verification step to access your account.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;3. Enable Advanced Data Protection&lt;/h3&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://support.apple.com/en-us/108756\"&gt;Advanced Data Protection&lt;/a&gt; is an Apple feature that is turned off by default. When enabled, it extends end-to-end encryption to more types of iCloud data, including backups, photos, and notes, beyond the apps that already have this protection by default. It can&amp;#8217;t be enabled for managed Apple IDs or child accounts, though.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;4. Disable iCloud syncing&lt;/h3&gt;\n\n\n\n&lt;p&gt;If you don&amp;#8217;t use specific Apple apps, such as Mail, Calendars, or Contacts, it&amp;#8217;s safer to turn off iCloud syncing for these services since they can’t be protected with end-to-end encryption.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"proton-pass\"&gt;Proton Pass keeps your data safe and private&lt;/h2&gt;\n\n\n\n&lt;p&gt;Proton Pass is an encrypted password manager for &lt;a href=\"https://proton.me/support/use-pass-ios\"&gt;iOS&lt;/a&gt; and other platforms that keeps all your passwords stored in a safe place. You can easily &lt;a href=\"https://proton.me/support/pass-import-safari\"&gt;import passwords from Safari&lt;/a&gt;, generate strong passwords, &lt;a href=\"https://protonvpn.com/support/ios-password-autofill/\"&gt;autofill&lt;/a&gt; them, and &lt;a href=\"https://proton.me/support/pass-ios-share\"&gt;safely share passwords&lt;/a&gt; with anyone.&lt;/p&gt;\n\n\n\n&lt;p&gt;Our app supports &lt;a href=\"https://proton.me/support/pass-use-passkeys#How-to-use-Proton-Pass-passkeys-on-iPhone\"&gt;passkeys&lt;/a&gt; on multiple platforms, which you can easily share or export. Additionally, you can use a &lt;a href=\"https://proton.me/support/pass-2fa\"&gt;built-in 2FA authenticator&lt;/a&gt; to add two-factor authentication to any account that supports it, protect your real email address with &lt;a href=\"https://proton.me/support/pass-alias-ios\"&gt;email aliases&lt;/a&gt;, write secure notes, protect your payment details, and create &lt;a href=\"https://proton.me/support/pass-vault\"&gt;vaults&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://proton.me/pass/pass-monitor\"&gt;Pass Monitor&lt;/a&gt; is a feature that checks your account&amp;#8217;s security. It uses Password Health to identify weak or reused passwords, and Dark Web Monitoring to check if your personal data is leaked online. Plus, &lt;a href=\"https://proton.me/support/proton-sentinel\"&gt;Proton Sentinel&lt;/a&gt; provides advanced security against hackers.&lt;/p&gt;\n\n\n\n&lt;p&gt;We use &lt;a href=\"https://proton.me/security/end-to-end-encryption\"&gt;end-to-end encryption&lt;/a&gt; to make sure no one can see your passwords and other personal information — not even us. All our apps are &lt;a href=\"https://proton.me/community/open-source\"&gt;open source&lt;/a&gt; and audited by third parties. Furthermore, we are primarily &lt;a href=\"https://proton.me/blog/proton-non-profit-foundation\"&gt;owned by a non-profit&lt;/a&gt; dedicated to promoting online privacy.&lt;/p&gt;\n\n\n\n&lt;p&gt;Improve your iPhone password protection by &lt;a href=\"https://proton.me/pass\"&gt;signing up for a free Proton Pass account&lt;/a&gt;.&lt;/p&gt;\n   </content:encoded>\n   <category>\n    Privacy guides\n   </category>\n   <author>\n    Elena Constantinescu\n   </author>\n  </item>\n  <item>\n   <title>\n    Proton Pass launches Secure Links for safe, convenient password sharing\n   </title>\n   <link/>\n   https://proton.me/blog/pass-secure-link-sharing\n   <guid ispermalink=\"true\">\n    https://proton.me/blog/pass-secure-link-sharing\n   </guid>\n   <description>\n    Share passwords, bank details, and other sensitive data securely using unique, end-to-end encrypted links with anyone.\n   </description>\n   <pubdate>\n    Fri, 12 Jul 2024 11:42:49 GMT\n   </pubdate>\n   <content:encoded>\n    &lt;p&gt;There are many reasons you may need to share passwords, bank details, and other highly sensitive information. But we noticed that many people do this via messaging apps or other methods that put your data at risk.&lt;/p&gt;\n\n\n\n&lt;p&gt;In response to the needs of our community, we’re excited to announce that you now have a more secure and convenient way to share your items in your password manager with anyone, even if they don’t use Proton Pass.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;With Secure Links, you can copy and paste unique, expirable links to your logins, bank cards, notes, and other items while preserving end-to-end encryption. Proton Pass makes securely sharing sensitive information simple and lets you manage your Secure Links from a central dashboard, ensuring you’re always in complete control of the items you’ve shared.&lt;/p&gt;\n\n\n\n&lt;p&gt;Starting today, we&amp;#8217;ll begin rolling out Secure Links to everyone with a Proton Visionary or Lifetime plan. In the coming days, everyone with a paid Pass plan will be able to use Secure Links.&lt;/p&gt;\n\n\n\n&lt;p&gt;For a limited time, we’re helping more people take advantage of secure sharing and other advanced features by &lt;strong&gt;offering a year of Pass Plus for only $12&lt;/strong&gt;. You not only get Secure Links but also unlimited vaults and &lt;a href=\"https://proton.me/pass/aliases\"&gt;hide-my-email aliases&lt;/a&gt;, &lt;a href=\"https://proton.me/pass/pass-monitor\"&gt;Dark Web Monitoring&lt;/a&gt;, our &lt;a href=\"https://proton.me/blog/sentinel-included-pass-plus\"&gt;Proton Sentinel&lt;/a&gt; security program, integrated 2FA authenticator, and more. This offer ends July 21.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;div class=\"text-center\"&gt;&lt;a class=\"btn inline-block rounded-full font-bold btn-small bg-purple-500 text-white hover:text-white focus:text-white\" href=\"https://account.proton.me/pass/signup?&amp;#038;coupon=SECURESHARING\"&gt;Get the Pass Plus deal&lt;/a&gt;&lt;/div&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Why traditional password sharing is not secure&lt;/h2&gt;\n\n\n\n&lt;p&gt;It’s no secret that many people share passwords to streaming services and other subscription accounts. Family members also need to share other items like credit cards, ID numbers, and bank account logins. In the workplace, colleagues need access to shared WiFi passwords, social media accounts, and more.&lt;/p&gt;\n\n\n\n&lt;p&gt;Unfortunately, in most cases people share these sensitive items using methods that are inconvenient and not secure, such as text message or email. This makes it difficult to restrict access in the future, and whenever you update your password or other item details, you have to resend the information. Moreover, this increases the risk of &lt;a href=\"https://proton.me/blog/how-to-prevent-data-breach\"&gt;data breaches&lt;/a&gt;, &lt;a href=\"https://proton.me/blog/identity-theft-protection\"&gt;identity theft&lt;/a&gt;, or more &lt;a href=\"https://protonvpn.com/blog/types-of-cyberattacks\"&gt;sophisticated attacks&lt;/a&gt;. Sharing passwords outside of Proton Pass in cleartext breaks end-to-end encryption.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Secure Links are easy to use and protect your data&lt;/h2&gt;\n\n\n\n&lt;p&gt;These unique, expirable links give you more flexibility and control over the items in your Proton Pass account without having to share sensitive information outside of Pass.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;Importantly, you still have the ability to share items in your Proton Pass account using &lt;a href=\"https://proton.me/support/pass-vault\"&gt;vaults&lt;/a&gt;. But Secure Links are designed to let you share single items more easily, including with people who don’t have a Pass account.&lt;/p&gt;\n\n\n\n&lt;p&gt;Here’s how Secure Link sharing works:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Easy as copy and paste: &lt;/strong&gt;Sharing links is simple. You can generate, update, or delete Secure Links with a few clicks on any app.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;You’re in control:&lt;/strong&gt; Set a date for the link to expire (anywhere from one hour up to 30 days) or restrict the number of times your recipient can access the link (from one to infinity). When you’re done sharing, just click the &lt;strong&gt;Remove link&lt;/strong&gt; button in your dashboard.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Encrypted at all times:&lt;/strong&gt; Secure Links are end-to-end encrypted so only you and the people you share with can ever see your data. Not even Proton can access it: Secure Links are generated on your device, and when recipients open the link, the browser only sends the first part of the URL (before #decryptionkey) to the Proton servers. This means Proton never has access to the content of your Secure Link.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Better security without compromising convenience&lt;/h2&gt;\n\n\n&lt;div class=\"wp-block-image\"&gt;\n&lt;figure class=\"aligncenter size-large\"&gt;&lt;img width=\"1024\" height=\"573\" data-public-id=\"wp-pme/pass-secure-link-extra-password-email/pass-secure-link-extra-password-email.png\" loading=\"lazy\" decoding=\"async\" src=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_573,c_scale/f_auto,q_auto/v1720554608/wp-pme/pass-secure-link-extra-password-email/pass-secure-link-extra-password-email.png?_i=AA\" alt=\"secure link sharing\" class=\"wp-post-76227 wp-image-76236\" data-format=\"png\" data-transformations=\"f_auto,q_auto\" data-version=\"1720554608\" data-seo=\"1\" srcset=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_573,c_scale/f_auto,q_auto/v1720554608/wp-pme/pass-secure-link-extra-password-email/pass-secure-link-extra-password-email.png?_i=AA 1024w, https://res.cloudinary.com/dbulfrlrz/images/w_300,h_168,c_scale/f_auto,q_auto/v1720554608/wp-pme/pass-secure-link-extra-password-email/pass-secure-link-extra-password-email.png?_i=AA 300w, https://res.cloudinary.com/dbulfrlrz/images/w_768,h_430,c_scale/f_auto,q_auto/v1720554608/wp-pme/pass-secure-link-extra-password-email/pass-secure-link-extra-password-email.png?_i=AA 768w, https://res.cloudinary.com/dbulfrlrz/images/f_auto,q_auto/v1720554608/wp-pme/pass-secure-link-extra-password-email/pass-secure-link-extra-password-email.png?_i=AA 1072w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /&gt;&lt;/figure&gt;&lt;/div&gt;\n\n\n&lt;p&gt;Because Proton Pass is powered by our community rather than advertisers or venture investors, we are able to prioritize your security and privacy above everything else. And since we’re &lt;a href=\"https://proton.me/foundation\"&gt;owned by a nonprofit&lt;/a&gt;, we’re only accountable to you and to our mission to expand global access to privacy.&lt;/p&gt;\n\n\n\n&lt;p&gt;To that end, in response to feedback from the community, &lt;strong&gt;we’re also launching an Extra Password feature&lt;/strong&gt; alongside Secure Links. This optional feature lets you create a second password to access credentials stored in Pass for greater compartmentalization and peace of mind. Extra Password is available to the entire Proton Pass community, including those with Free plans.&lt;/p&gt;\n\n\n\n&lt;p&gt;You can turn on Extra Password now in your security settings. &lt;a href=\"https://proton.me/support/pass-extra-password\"&gt;Learn more.&lt;/a&gt;&lt;/p&gt;\n\n\n\n&lt;p&gt;With these new features, we aim to give you the best security possible without asking you to change the way you already use, share, and enjoy your password manager. We look forward to your feedback, which will directly shape the future of our products at Proton.&lt;/p&gt;\n   </content:encoded>\n   <category>\n    Product updates\n   </category>\n   <category>\n    Proton Pass\n   </category>\n   <author>\n    Son Nguyen\n   </author>\n  </item>\n  <item>\n   <title>\n    How to build privacy-protecting AI\n   </title>\n   <link/>\n   https://proton.me/blog/how-to-build-privacy-first-ai\n   <guid ispermalink=\"true\">\n    https://proton.me/blog/how-to-build-privacy-first-ai\n   </guid>\n   <description>\n    AI offers incredible productivity gains, often at the cost of privacy. Is it possible to build AI that protects privacy? We explain how it can be done.\n   </description>\n   <pubdate>\n    Mon, 08 Jul 2024 14:14:28 GMT\n   </pubdate>\n   <content:encoded>\n    &lt;p&gt;Large language models (LLMs) trained on public datasets can serve a wide range of purposes, from composing blog posts to programming. However, their true potential lies in contextualization, achieved by either fine-tuning the model or enriching its prompts with specific additional information. This process typically involves inputting custom data into the LLM, which might contain sensitive material such as personal messaging history, internal company documents, or workplace communications. The absence of robust privacy safeguards in these scenarios is one of the primary reasons why countries like&lt;a href=\"https://www.bbc.com/news/technology-65139406\" target=\"_blank\" rel=\"noreferrer noopener\"&gt; Italy have imposed bans&lt;/a&gt; on platforms like ChatGPT.&lt;/p&gt;\n\n\n\n&lt;p&gt;LLMs are incredible tools, and we&amp;#8217;ve only begun to scratch the surface of what they can do. However, like any tool, LLMs can be abused, particularly for surveillance. In this article, we show what we think the future of AI should look like, one where you can interact with LLMs and know the information you share is safe.&lt;/p&gt;\n\n\n\n&lt;p&gt;Currently, you have two options if you want to run an LLM:&lt;/p&gt;\n\n\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Locally on your device: &lt;/strong&gt;The LLM runs directly on your hardware using your browser and never interacts with external servers. This is the most private form of AI inference since your data never exits your machine, but it requires a machine with a powerful GPU due to the intensive calculations required by the LLM.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Server side: &lt;/strong&gt;Your requests are sent to external servers, which perform the LLM calculations using high-end GPUs. This AI instance has no specific hardware requirements and can be run on almost any smartphone, laptop, or desktop with internet connectivity. However, running requests on an external server increases data exposure risks unless the servers are secured and do not log your prompts or responses.&lt;/li&gt;\n&lt;/ol&gt;\n\n\n\n&lt;p&gt;This article looks at:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;The performance and openness of different LLMs, and explains which jobs each model is best suited to perform.&lt;/li&gt;\n\n\n\n&lt;li&gt;The technical challenges presented by &lt;strong&gt;on-device LLMs&lt;/strong&gt; (for example, how to get them to run locally on your device).&lt;/li&gt;\n\n\n\n&lt;li&gt;How &lt;strong&gt;Server-side models &lt;/strong&gt;work, and what can be done to enable more privacy-centric server-side processing.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;&lt;strong&gt;Models&lt;/strong&gt;&lt;/h2&gt;\n\n\n\n&lt;p&gt;LLMs are trained on vast, diverse datasets sourced from the internet, including books, articles, and websites such as Wikipedia. This extensive data collection ensures the model learns the nuances of language, including syntax, semantics, and context.&lt;/p&gt;\n\n\n\n&lt;p&gt;The training process involves preprocessing the data through tokenization, normalization, and filtering to ensure quality and consistency. Using &lt;a href=\"https://huggingface.co/learn/nlp-course/en/chapter1/4\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Transformer architecture&lt;/a&gt;, the model learns by predicting the next word in a sentence and adjusting its internal parameters to minimize errors over millions or billions of examples. This computationally intensive process requires significant resources involving many powerful GPUs and days of training.&lt;/p&gt;\n\n\n\n&lt;p&gt;One advanced technique to refine LLMs is &lt;a href=\"https://huggingface.co/blog/rlhf\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Reinforcement Learning from Human Feedback&lt;/a&gt; (RLHF). In this approach, human evaluators provide feedback on the model&amp;#8217;s outputs, helping to fine-tune its responses. The feedback is used to train a reward model that predicts the quality of responses, and the LLM is further trained using reinforcement learning techniques guided by this reward model. RLHF ensures that the model&amp;#8217;s outputs align more closely with human expectations, improving its usability in real-world applications.&lt;/p&gt;\n\n\n\n&lt;p&gt;When a model is trained, you can then perform &lt;em&gt;inference&lt;/em&gt;, where the trained model generates predictions or responses based on new input data. This operation involves several steps, starting with a tokenized version of a user&amp;#8217;s prompt. The model processes new input through its neural network layers to generate a coherent and contextually appropriate response. The model then converts the generated tokens back into human-readable text.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;&lt;strong&gt;Model openness&lt;/strong&gt;&lt;/h3&gt;\n\n\n\n&lt;p&gt;One of the great success stories since the onset of ChatGPT has been the incredible work in creating open alternatives that anyone can use, thus democratizing LLMs.&lt;/p&gt;\n\n\n\n&lt;p&gt;However, whilst developers should be praised for their efforts, we should also be wary of &amp;#8220;open washing&amp;#8221;, akin to &amp;#8220;privacy washing&amp;#8221; or &amp;#8220;greenwashing&amp;#8221;, where companies say that their models are “open”, but actually only a small part is.&lt;/p&gt;\n\n\n&lt;div class=\"wp-block-image\"&gt;\n&lt;figure class=\"aligncenter size-large\"&gt;&lt;img width=\"1024\" height=\"490\" data-public-id=\"wp-pme/model-openness-2/model-openness-2.png\" loading=\"lazy\" decoding=\"async\" src=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_490,c_scale/f_auto,q_auto/v1720442390/wp-pme/model-openness-2/model-openness-2.png?_i=AA\" alt=\"\" class=\"wp-post-76176 wp-image-76209\" data-format=\"png\" data-transformations=\"f_auto,q_auto\" data-version=\"1720442390\" data-seo=\"1\" srcset=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_490,c_scale/f_auto,q_auto/v1720442390/wp-pme/model-openness-2/model-openness-2.png?_i=AA 1024w, https://res.cloudinary.com/dbulfrlrz/images/w_300,h_143,c_scale/f_auto,q_auto/v1720442390/wp-pme/model-openness-2/model-openness-2.png?_i=AA 300w, https://res.cloudinary.com/dbulfrlrz/images/w_768,h_367,c_scale/f_auto,q_auto/v1720442390/wp-pme/model-openness-2/model-openness-2.png?_i=AA 768w, https://res.cloudinary.com/dbulfrlrz/images/w_1536,h_735,c_scale/f_auto,q_auto/v1720442390/wp-pme/model-openness-2/model-openness-2.png?_i=AA 1536w, https://res.cloudinary.com/dbulfrlrz/images/w_1568,h_750,c_scale/f_auto,q_auto/v1720442390/wp-pme/model-openness-2/model-openness-2.png?_i=AA 1568w, https://res.cloudinary.com/dbulfrlrz/images/f_auto,q_auto/v1720442390/wp-pme/model-openness-2/model-openness-2.png?_i=AA 1723w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /&gt;&lt;figcaption class=\"wp-element-caption\"&gt;A subset of the most popular models and their openness shows that there are many scales of openness, from OLMo at the top (by AllenAI) down to ChatGPT, which is the worst. Source: &lt;a href=\"https://opening-up-chatgpt.github.io/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;https://opening-up-chatgpt.github.io/&lt;/a&gt;&lt;/figcaption&gt;&lt;/figure&gt;&lt;/div&gt;\n\n\n&lt;p&gt;Open LLMs like &lt;a href=\"https://huggingface.co/allenai/OLMo-7B-Instruct\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;OLMo 7B Instruct&lt;/a&gt; provide significant advantages in benchmarking, reproducibility, algorithmic transparency, bias detection, and community collaboration. They allow for rigorous performance evaluation and validation of AI research, which in turn promotes trust and enables the community to identify and address biases. Collaborative efforts lead to shared improvements and innovations, accelerating advancements in AI. Additionally, open LLMs offer flexibility for tailored solutions and experimentation, allowing users to customize and explore novel applications and methodologies.&lt;/p&gt;\n\n\n\n&lt;p&gt;By democratizing access to advanced AI, open LLMs help prevent the concentration of AI capabilities within a few dominant tech companies, promoting a more balanced distribution of power.&lt;/p&gt;\n\n\n\n&lt;p&gt;Conversely, Meta or OpenAI, for example, have a very different definition of “open” to &lt;a href=\"https://allenai.org/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;AllenAI&lt;/a&gt; (the institute behind OLMo 7B Instruct). These companies have made their code, data, weights, and research papers only partially available or haven’t shared them&amp;nbsp; at all.&lt;/p&gt;\n\n\n\n&lt;p&gt;Openness in LLMs is crucial for privacy and ethical data use, as it allows people to verify what data the model utilized and if this data was sourced responsibly. By making LLMs open, the community can scrutinize and verify the datasets, guaranteeing that personal information is protected and that data collection practices adhere to ethical standards. This transparency fosters trust and accountability, essential for developing AI technologies that respect user privacy and uphold ethical principles.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;&lt;strong&gt;Model size and performance&lt;/strong&gt;&lt;/h3&gt;\n\n\n\n&lt;h4 class=\"wp-block-heading\"&gt;&lt;strong&gt;Large models&lt;/strong&gt;&lt;/h4&gt;\n\n\n\n&lt;p&gt;So far, size matters when it comes to LLMs — bigger models perform better than smaller models for the following reasons:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Capacity to learn complex patterns&lt;/strong&gt;: With more parameters (over 70 billion for Llama3), larger models can learn and represent more complex patterns in the data. This allows them to generate more accurate and nuanced responses.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Better generalization&lt;/strong&gt;: Larger models can generalize better from training data to unseen data. They can capture a broader range of linguistic structures and nuances, leading to improved performance across various tasks.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Higher contextual understanding&lt;/strong&gt;: Larger models can maintain and process longer contexts, enabling them to generate more coherent and contextually appropriate responses. This is particularly important for tasks that require an understanding of extended text, such as summarization and dialogue generation.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Improved fine-tuning&lt;/strong&gt;: Larger models provide a better foundation for fine-tuning on specific tasks or domains. They can leverage their extensive pre-trained knowledge to adapt more effectively to specialized datasets, enhancing performance in specific applications.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;Large models, with their large number of parameters (and therefore weights), take up a lot of memory and require considerable CPU or GPU resources to perform inference effectively. So even if GPT4 was open, running it would still be prohibitively expensive.&lt;/p&gt;\n\n\n\n&lt;p&gt;There are, however, some ways to make large models smaller without dramatically sacrificing performance, including:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Model quantization: &lt;/strong&gt;This is when large, memory-hungry, floating-point representations of model weights are converted to 8-bit or 4-bit representations, allowing LLMs to use lower-precision arithmetic. This significantly reduces the device&amp;#8217;s memory and computational requirements without greatly sacrificing the model&amp;#8217;s accuracy.&lt;br&gt;&amp;#8220;Quantization and Training of Neural Networks for Efficient Integer-Arithmetic-Only Inference&amp;#8221; by Jacob et al., 2018.“ Llm. int8: 8-bit matrix multiplication for transformers at scale” by Dettmers et al., 2022.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Weight pruning: &lt;/strong&gt;This involves removing less significant weights from the model, reducing its size and computational demands while maintaining accuracy.&lt;br&gt;&amp;#8220;Learning both Weights and Connections for Efficient Neural Networks&amp;#8221; by Han et al., 2015.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;Then, finally, there is the option for smaller, more specialized, less resource-intensive models.&lt;/p&gt;\n\n\n\n&lt;h4 class=\"wp-block-heading\"&gt;&lt;strong&gt;Smaller models&lt;/strong&gt;&lt;/h4&gt;\n\n\n\n&lt;p&gt;With a smaller number of parameters, smaller models also require fewer calculations at inference time, making them faster and less resource intensive in terms of memory and GPU usage, opening the door to running LLMs directly on a consumer device.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;While smaller models typically don’t perform as well as larger models on a general basis due to their inability to capture more nuanced patterns in text, there are several ways we can make smaller models behave more like larger ones for specific tasks. These include:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Knowledge distillation: &lt;/strong&gt;This is when a large, pre-trained model (teacher) is used to train a smaller model (student) that mimics the performance of the larger model but with fewer parameters, making it more suitable for on-device execution.&lt;br&gt;&amp;#8220;Distilling the Knowledge in a Neural Network&amp;#8221; by Hinton, Vinyals, and Dean, 2015.&amp;#8221;DistilBERT, a distilled version of BERT: smaller, faster, cheaper and lighter&amp;#8221; by Sanh et al., 2019.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Mixture of Experts&lt;/strong&gt; (&lt;strong&gt;MoE&lt;/strong&gt;): MoE models, like Mixtral 8x7B, enhance performance by combining multiple specialized, smaller models (experts), each focusing on different aspects of the input data (for example, one model for punctuation, one for verbs, another form numbers, etc.). A gating mechanism dynamically selects the most relevant experts for each input, ensuring only a subset is activated, reducing computational costs and improving efficiency. This approach allows MoE models to specialize and scale effectively while providing high accuracy and robustness across diverse tasks without proportional increases in computational demands.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;Models like Mixtral 8x7B Instruct outperform models like Llama2, with its 70 billion parameters, in terms of their ability to generate coherent content, but are also six times faster to perform inference on.&lt;br&gt;&lt;br&gt;For very large models, Mixtral 8x22B models can perform on par or even better than GPT4 and GPT3.5. Given that GPT4 uses a reported 1.76 trillion parameters, it’s impressive that a model with an order of magnitude fewer parameters can perform similarly.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;&lt;strong&gt;On-device LLMs&lt;/strong&gt;&lt;/h2&gt;\n\n\n\n&lt;p&gt;The open nature of models and subsequent developments by researchers and engineers have led to LLMs that can run on a user device without a dramatic dip in accuracy or speed.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;On-device LLMs can deliver powerful AI capabilities while preserving user privacy and thus work within E2EE settings. A few open-source projects, most notably &lt;a href=\"https://github.com/ggerganov/llama.cpp\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Llamacpp&lt;/a&gt; and &lt;a href=\"https://webllm.mlc.ai/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;WebLLM&lt;/a&gt;, make it easier to run LLMs locally.&lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://github.com/ggerganov/llama.cpp\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Llamacpp&lt;/a&gt; is an open-source C++ library that allows you to run your own OpenAI-compatible API on top of an LLM on your machine (or server) utilizing CPUs or GPUs. One of the key optimization techniques used in llama.cpp is quantization, which significantly reduces the memory footprint and speeds up inference without large sacrifices on accuracy.&lt;/p&gt;\n\n\n\n&lt;p&gt;Llamacpp requires models to be loaded from the GPT-Generated Unified Format (GGUF), a custom binary format that efficiently stores machine-learning model parameters. It’s designed to optimize the storage and access of model weights, particularly for scenarios where models need to be loaded quickly and used in memory-constrained environments.&lt;/p&gt;\n\n\n\n&lt;p&gt;The &lt;a href=\"https://webllm.mlc.ai/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;WebLLM&lt;/a&gt; project allows you to run LLMs directly in your web browser. WebLLM leverages the power of &lt;a href=\"https://www.w3.org/TR/webgpu/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;WebGPU&lt;/a&gt; and the optimization prowess of &lt;a href=\"https://tvm.apache.org/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Apache TVM&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;p&gt;Apache TVM is an open-source machine learning compiler that plays a crucial role in making WebLLM possible using:&lt;/p&gt;\n\n\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Model transformation&lt;/strong&gt;: Models crafted in high-level frameworks like TensorFlow or PyTorch are imported into TVM. TVM then converts these models into an intermediate representation (IR) that can be fine-tuned for performance.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Optimization&lt;/strong&gt;: TVM performs a series of sophisticated optimizations on this IR. It fuses operations to reduce redundant memory access, plans memory usage efficiently, and restructures computation graphs for maximum parallelism. This step is key to making models run fast and lean on your browser’s GPU.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Code Generation&lt;/strong&gt;: Once optimized, TVM generates code tailored for WebGPU. This involves compiling kernels and creating runtime code that can execute efficiently on the GPU.&lt;/li&gt;\n&lt;/ol&gt;\n\n\n\n&lt;p&gt;WebGPU is a modern graphics API designed to give web applications direct access to GPU power. For WebLLM, WebGPU is the engine that runs the finely tuned code generated by Apache TVM. Here’s how it fits into the picture:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Resource management&lt;/strong&gt;: WebGPU handles the allocation and management of GPU memory for model parameters, input data, and computations, ensuring the efficient use of resources.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Shader execution&lt;/strong&gt;: It compiles and runs shaders — small programs on the GPU — that carry out the heavy lifting of neural network operations.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Command Handling&lt;/strong&gt;: WebGPU encodes and submits commands to the GPU, orchestrating the execution of the optimized code and ensuring smooth operation.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;At this moment, &lt;a href=\"https://caniuse.com/webgpu\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;WebGPU support&lt;/a&gt; isn’t present across all browsers, at least not by default. Safari, for example, has only recently added support in its &amp;#8220;Technology Preview&amp;#8221; version, and Firefox makes you enable a flag called dom.webgpu.enabled. Practically no mobile browsers, apart from Chromium-based ones, support WebGPU. These caveats make it difficult to support all users by default.&lt;/p&gt;\n\n\n\n&lt;p&gt;There are also other considerations besides the lack of WebGPU support that make in-browser models difficult to run. To run a model locally, you must have:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Sufficient bandwidth:&lt;/strong&gt; You must download a multi-GB model (again, larger models will typically yield better results).&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;A reasonably powerful GPU:&lt;/strong&gt; If you have a Mac, any Apple M series machine can run a 7B parameter model. If you use Windows or Linux, a dedicated GPU with 6 GB VRAM will run an LLM.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;As you can see, it’s already possible to run a personalized LLM with secure access to your personalized data on your computer or smartphone — as long as your device is powerful enough. Unfortunately, this requirement prices out many people. Most models are also prohibitively large, making it difficult to download them in remote locations or in countries with poor internet infrastructure.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;&lt;strong&gt;The future of on-device&lt;/strong&gt;&lt;/h3&gt;\n\n\n\n&lt;p&gt;While the ability to run on-device LLMs is currently limited to the best, most powerful, and most expensive devices, we’ve already seen remarkable technological progress over the past two years towards making LLMs available to everyone. The trends we see today will likely continue to move towards:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Local by default: &lt;/strong&gt;LLMs are expensive to run, so off-loading generation to the client makes sense both from a privacy and cost perspective. More support for WebGPU will make it easier for &lt;em&gt;all users&lt;/em&gt; to run models in their browsers.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Smaller LLMs: &lt;/strong&gt;task-specific LLMs will become more common, allowing you to switch between models as you switch between tasks — for example, one for email, one for document creation, one for image, audio, search, and so on. Smaller models run faster and are already shown to perform as well as, and, &lt;a href=\"https://huggingface.co/defog/sqlcoder-7b-2\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;in some cases, better than&lt;/a&gt; large models such as GPT 4 on specific tasks.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;LLMs within SDKs/browsers: &lt;/strong&gt;Application developers will soon be able to call LLMs much like they call other features in an SDK, such as getting access to the user&amp;#8217;s camera in an Android application. This will make LLM integration easier and, if handled on-device, private by default as well.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;&lt;strong&gt;Server-side LLMs&lt;/strong&gt;&lt;/h2&gt;\n\n\n\n&lt;p&gt;Server-side models remain the fastest and most reliable method for running LLMs, ensuring robust performance and stability.&lt;/p&gt;\n\n\n\n&lt;p&gt;Running LLMs on your own machine enhances your privacy but requires powerful hardware to effectively manage the computational demands.&lt;/p&gt;\n\n\n\n&lt;p&gt;We have already seen how LlamaCPP can be used to run models on consumer devices, but it can also be used on servers, providing the interfaces to run models performantly on high-end GPUs. It has support for the functionalities required to run LLMs in more production-level environments with parallelism (to serve multiple users at the same time), access tokens (to provide server access only to those with permission), SSL (to encrypt traffic from a client to server), and health monitoring (to ensure your system is alive).&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;&lt;strong&gt;Server-side models&lt;/strong&gt;&lt;/h3&gt;\n\n\n\n&lt;p&gt;While the models mentioned earlier for on-device can also work server side, it typically makes sense to run more powerful models to get better performance (should you need it). Looking at the graph below, you will see how Mixtral 8x22B models compare with GPT 4 Turbo or GPT 3.5 Turbo. If you want ChatGPT-level model performance, you can already get very close to it.&lt;/p&gt;\n\n\n&lt;div class=\"wp-block-image\"&gt;\n&lt;figure class=\"aligncenter size-large\"&gt;&lt;img width=\"1024\" height=\"617\" data-public-id=\"wp-pme/server-side-performance2x/server-side-performance2x.png\" loading=\"lazy\" decoding=\"async\" src=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_617,c_scale/f_auto,q_auto/v1720425818/wp-pme/server-side-performance2x/server-side-performance2x.png?_i=AA\" alt=\"\" class=\"wp-post-76176 wp-image-76197\" data-format=\"png\" data-transformations=\"f_auto,q_auto\" data-version=\"1720425818\" data-seo=\"1\" srcset=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_617,c_scale/f_auto,q_auto/v1720425818/wp-pme/server-side-performance2x/server-side-performance2x.png?_i=AA 1024w, https://res.cloudinary.com/dbulfrlrz/images/w_300,h_181,c_scale/f_auto,q_auto/v1720425818/wp-pme/server-side-performance2x/server-side-performance2x.png?_i=AA 300w, https://res.cloudinary.com/dbulfrlrz/images/w_768,h_463,c_scale/f_auto,q_auto/v1720425818/wp-pme/server-side-performance2x/server-side-performance2x.png?_i=AA 768w, https://res.cloudinary.com/dbulfrlrz/images/w_1536,h_926,c_scale/f_auto,q_auto/v1720425818/wp-pme/server-side-performance2x/server-side-performance2x.png?_i=AA 1536w, https://res.cloudinary.com/dbulfrlrz/images/w_1568,h_946,c_scale/f_auto,q_auto/v1720425818/wp-pme/server-side-performance2x/server-side-performance2x.png?_i=AA 1568w, https://res.cloudinary.com/dbulfrlrz/images/f_auto,q_auto/v1720425818/wp-pme/server-side-performance2x/server-side-performance2x.png?_i=AA 1723w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /&gt;&lt;figcaption class=\"wp-element-caption\"&gt;Server-side model performance for text summarization and composition performed by Apple, adapted from &lt;a href=\"https://machinelearning.apple.com/research/introducing-apple-foundation-models\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;https://machinelearning.apple.com/research/introducing-apple-foundation-models&lt;/a&gt;&lt;/figcaption&gt;&lt;/figure&gt;&lt;/div&gt;\n\n\n&lt;p&gt;However, as stated before, it’s debatable whether you need ChatGPT-level performance for most tasks. Using one large model for all tasks is wasteful, like hiring a gourmet chef to boil potatoes. The chef will do it, but you&amp;#8217;ll pay a hefty price for the privilege. Just because you &lt;em&gt;can&lt;/em&gt; doesn’t mean you should.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;&lt;strong&gt;The future of server-side inference&lt;/strong&gt;&lt;/h3&gt;\n\n\n\n&lt;p&gt;Homomorphic encryption (HE) is a promising, albeit still developing, approach to enable privacy-preserving inference on LLMs across networks.&lt;/p&gt;\n\n\n\n&lt;p&gt;HE is important because it offers a powerful way to work with encrypted data. It allows computations to be performed on ciphertexts that, when decrypted, yield the same result as if the operations had been performed on the plaintext. This characteristic makes HE particularly intriguing for applications involving sensitive data, including working with LLMs.&lt;/p&gt;\n\n\n&lt;div class=\"wp-block-image\"&gt;\n&lt;figure class=\"aligncenter size-large\"&gt;&lt;img width=\"1024\" height=\"617\" data-public-id=\"wp-pme/gpt-architecture-fhe-1/gpt-architecture-fhe-1.png\" loading=\"lazy\" decoding=\"async\" src=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_617,c_scale/f_auto,q_auto/v1720425828/wp-pme/gpt-architecture-fhe-1/gpt-architecture-fhe-1.png?_i=AA\" alt=\"\" class=\"wp-post-76176 wp-image-76193\" data-format=\"png\" data-transformations=\"f_auto,q_auto\" data-version=\"1720425828\" data-seo=\"1\" srcset=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_617,c_scale/f_auto,q_auto/v1720425828/wp-pme/gpt-architecture-fhe-1/gpt-architecture-fhe-1.png?_i=AA 1024w, https://res.cloudinary.com/dbulfrlrz/images/w_300,h_181,c_scale/f_auto,q_auto/v1720425828/wp-pme/gpt-architecture-fhe-1/gpt-architecture-fhe-1.png?_i=AA 300w, https://res.cloudinary.com/dbulfrlrz/images/w_768,h_463,c_scale/f_auto,q_auto/v1720425828/wp-pme/gpt-architecture-fhe-1/gpt-architecture-fhe-1.png?_i=AA 768w, https://res.cloudinary.com/dbulfrlrz/images/w_1536,h_925,c_scale/f_auto,q_auto/v1720425828/wp-pme/gpt-architecture-fhe-1/gpt-architecture-fhe-1.png?_i=AA 1536w, https://res.cloudinary.com/dbulfrlrz/images/w_1568,h_945,c_scale/f_auto,q_auto/v1720425828/wp-pme/gpt-architecture-fhe-1/gpt-architecture-fhe-1.png?_i=AA 1568w, https://res.cloudinary.com/dbulfrlrz/images/f_auto,q_auto/v1720425828/wp-pme/gpt-architecture-fhe-1/gpt-architecture-fhe-1.png?_i=AA 1723w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /&gt;&lt;figcaption class=\"wp-element-caption\"&gt;GPT2 with fully homomorphic encryption (FHE) replicates the overall GPT2 architecture, but with the difference that the client performs part of the work and the server performs the computationally heavy, self-attention operations in an FHE way. Adapted from &lt;a href=\"https://huggingface.co/blog/encrypted-llm\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;https://huggingface.co/blog/encrypted-llm&lt;/a&gt;&lt;/figcaption&gt;&lt;/figure&gt;&lt;/div&gt;\n\n\n&lt;p&gt;Homomorphic computing is a method of performing computations on encrypted data without needing to decrypt it first. This approach preserves privacy and security throughout the computational process. Here&amp;#8217;s how it can be applied to perform inference on a LLM:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Encryption:&lt;/strong&gt; User input (for example, text) is encrypted using a homomorphic encryption scheme. This ensures that the input data remains confidential and secure.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Computation: &lt;/strong&gt;The LLM, which has been adapted to support homomorphic operations,&amp;nbsp; processes the encrypted input. The model performs its calculations directly on the encrypted data, generating an encrypted output.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Decryption:&lt;/strong&gt; The encrypted result produced by the LLM is then decrypted to provide the final plaintext output to the user.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;While homomorphic encryption already exists, it&amp;#8217;s still in its early stages and can&amp;#8217;t yet scale to handle LLMs for a number of reasons:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Performance&lt;/strong&gt;: Homomorphic encryption is computationally intensive and can significantly slow down the inference process. Advances in hardware and optimization techniques are needed to make this approach practical for real-time applications.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Model adaptation&lt;/strong&gt;: Existing LLMs need to be adapted to support homomorphic operations, which can be complex and require specialized knowledge in both cryptography and machine learning.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Scalability&lt;/strong&gt;: Ensuring that the homomorphic encryption scheme can scale to handle large models and large volumes of data is crucial for widespread adoption.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://www.zama.ai/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Zama&lt;/a&gt;, for example, is trying to build fully homomorphic encryption (FHE) into ML algorithms and has a &lt;a href=\"https://huggingface.co/blog/encrypted-llm\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;functional example&lt;/a&gt; of how to do this with GPT-2 models, although slowly (and expensively). However, as &lt;a href=\"https://www.zama.ai/post/chatgpt-privacy-with-homomorphic-encryption\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Zama explains&lt;/a&gt;, there is a path forward to FHE LLMs in the next few years through further LLM compression, improvements to the cryptography behind FHE, and dedicated hardware acceleration predicted to arrive in 2025.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;&lt;strong&gt;Privacy is the future of AI&lt;/strong&gt;&lt;/h2&gt;\n\n\n\n&lt;p&gt;Generative AI is potentially a generation-defining development — one that&amp;#8217;s on the mind of the Proton community, as was made evident in our &lt;a href=\"https://proton.me/blog/2024-proton-survey-results\"&gt;2024 survey&lt;/a&gt;. Recent technological developments have made LLMs more open, smaller, and faster, opening entirely new possibilities for GenAI.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;Today, many people can already run a personalized, fully private AI assistant on their device by combining these LLMs with your own content — something that was only possible in the realm of science fiction a handful of years ago.&lt;/p&gt;\n\n\n\n&lt;p&gt;The next frontier is bringing this level of performance to people with connectivity or device limitations. FHE seems like it could bridge this gap, allowing for encrypted, privacy-respecting LLMs in the not-so-distant future. Until then, server-side models running on high-performance GPUs will remain the fastest way to generate content under these adverse conditions, but at the possible cost of some levels of privacy.&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;If you want to work on building privacy protecting AI and related technologies, check out our careers page for potential openings.&lt;/p&gt;\n   </content:encoded>\n   <category>\n    Privacy news\n   </category>\n   <author>\n    Eamonn Maguire\n   </author>\n  </item>\n  <item>\n   <title>\n    Is Google Docs secure and does it respect your privacy?\n   </title>\n   <link/>\n   https://proton.me/blog/is-google-docs-secure\n   <guid ispermalink=\"true\">\n    https://proton.me/blog/is-google-docs-secure\n   </guid>\n   <description>\n    We’re looking into Google Docs' security risks to see how your data might be exposed and ways to protect it.\n   </description>\n   <pubdate>\n    Fri, 05 Jul 2024 10:52:56 GMT\n   </pubdate>\n   <content:encoded>\n    &lt;p&gt;Your &lt;a href=\"https://proton.me/blog/what-is-your-data-worth\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;online data is incredibly valuable&lt;/a&gt;, particularly to companies like Google that use it to make money through ads. This, along with &lt;a href=\"https://proton.me/blog/google-privacy-washing\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Google’s numerous privacy violations&lt;/a&gt;, has led many to question the safety of their information and find &lt;a href=\"https://proton.me/blog/how-to-de-google\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;alternatives to Google&lt;/a&gt;.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;Google Docs has &lt;a href=\"https://marketsplash.com/google-workspace-statistics/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;over 1 billion&lt;/a&gt; active monthly users, making it one of the most popular productivity tools, especially as more people work from home. But there are many reasons that Google Docs may not be the most secure or private home for your data. Google does not use end-to-end encryption, meaning the company has access to your data, which could be exposed in a data breach.&lt;/p&gt;\n\n\n\n&lt;p&gt;This article examines the security of Google Docs and the many concerning privacy issues. We also offer tips to improve your Google Docs security and alternatives to try instead.&lt;/p&gt;\n\n\n\n&lt;p&gt;Or skip to the following sections:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"#what-makes-Google-Docs-so-popular\"&gt;What makes Google Docs so popular?&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#Does-Google-Docs-protect-your-privacy\"&gt;How secure are Google Docs?&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#Does Google Docs protect your privacy\"&gt;Does Google Docs protect your privacy?&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#How-to-increase-your-Google-Docs-security\"&gt;How to increase your Google Docs security&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#Secure-your-data-with-Proton-Drive\"&gt;Secure your data with Proton Docs&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"#proton-defends-you\"&gt;How Proton defends you&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"What-makes-Google-Docs-so-popular\"&gt;What makes Google Docs so popular?&lt;/h2&gt;\n\n\n\n&lt;p&gt;Google Docs is a web-based application that allows users to create, edit, and store documents in the cloud. Its key features include real-time collaboration, automatic saving, and easy sharing options.&lt;/p&gt;\n\n\n\n&lt;p&gt;You can access your documents from any device with an internet connection, view version history to track and roll back content changes, suggest changes to a file for reviews, and work on documents offline. Google Docs is flexible and accessible, especially since it&amp;#8217;s free. But “free” just means you &lt;a href=\"https://proton.me/blog/ad-free-business-model\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;pay in other ways&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"How-secure-are-Google-Docs\"&gt;How secure are Google docs?&lt;/h2&gt;\n\n\n\n&lt;p&gt;Google hasn&amp;#8217;t experienced any publicly reported data breaches since 2018, when a bug in the Google+ API &lt;a href=\"https://www.wired.com/story/google-plus-bug-52-million-users-data-exposed/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;exposed the private data&lt;/a&gt; of over 50 million users. However, its security features aren’t airtight.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Encryption&lt;/h3&gt;\n\n\n\n&lt;p&gt;Google Docs uses &lt;a href=\"https://protonvpn.com/blog/what-is-aes-encryption/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;AES-256 encryption&lt;/a&gt; to secure your data in transit, at rest, on Google&amp;#8217;s servers, and during backups. Any information being transferred between the user’s device and Google’s servers is &lt;a href=\"https://cloud.google.com/docs/security/encryption/default-encryption\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;encrypted&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;p&gt;If a hacker gets their hands on your data in transit, they wouldn&amp;#8217;t be able to read it due to encryption. However, Google can see everything you do since it doesn’t use &lt;a href=\"https://proton.me/blog/what-is-end-to-end-encryption\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;end-to-end encryption&lt;/a&gt;, so your data is more vulnerable to data breaches affecting Google’s servers.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Account security&lt;/h3&gt;\n\n\n\n&lt;p&gt;Google accounts support &lt;a href=\"https://proton.me/blog/what-is-two-factor-authentication-2fa\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;two-factor authentication (2FA)&lt;/a&gt; and &lt;a href=\"https://proton.me/blog/what-is-a-passkey\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;passkeys&lt;/a&gt;, making unauthorized access more difficult. 2FA &lt;a href=\"https://support.google.com/accounts/answer/185839\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;adds a second form of verification&lt;/a&gt;, like sending a code on an authenticator, while passkeys let you sign in to your Google account with your fingerprint, face scan, or device screen lock, like a PIN.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Access controls&lt;/h3&gt;\n\n\n\n&lt;p&gt;By default, your Google Drive documents are set to private. As an owner, you can configure permission settings and select who can view, comment on, or edit your documents, such as individual users, groups, or anyone by creating shareable links. It&amp;#8217;s also possible to see who has accessed documents and what changes have been made, as well as to set expiration dates if you have a school or work account.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Malware protection&lt;/h3&gt;\n\n\n\n&lt;p&gt;Google automatically processes your content to provide spam filtering, virus detection, and malware protection. If any document is suspicious, Google shows a warning in Drive, including others you may have shared the file with, and it also notifies you via email.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"Does-Google-Docs-protect-your-privacy\"&gt;Does Google Docs protect your privacy?&lt;/h2&gt;\n\n\n\n&lt;p&gt;&lt;strong&gt;Google often uses &lt;/strong&gt;&lt;a href=\"https://proton.me/blog/google-privacy-washing\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;&lt;strong&gt;misleading privacy claims&lt;/strong&gt;&lt;/a&gt; and prefers to settle lawsuits totaling billions of dollars rather than face in-depth scrutiny.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;For example, Google settled a $93 million lawsuit in 2023, when it &lt;a href=\"https://www.reuters.com/legal/google-reaches-93-million-privacy-settlement-with-california-2023-09-14/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;deceived&lt;/a&gt; users by continuing to track their location data even after they had turned off the location history setting on their devices. In 2020, Google faced a $5 billion class-action lawsuit for collecting user data when using the &lt;a href=\"https://proton.me/blog/google-incognito-lawsuit\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Google Chrome incognito browsing mode&lt;/a&gt;, which it also settled.&lt;/p&gt;\n\n\n\n&lt;p&gt;Considering the company’s track record on privacy, it’s helpful to investigate how Google collects and uses the contents of your files in Google Docs.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Data collection&lt;/h3&gt;\n\n\n\n&lt;p&gt;According to its &lt;a href=\"https://policies.google.com/privacy\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;privacy policy&lt;/a&gt;, Google collects the content you create, upload, or share with others — including everything in your Google documents.&lt;/p&gt;\n\n\n\n&lt;p&gt;Google specifically &lt;a href=\"https://support.google.com/docs/answer/10381817?hl=en\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;processes your content in Google Docs&lt;/a&gt; to search for spam and malware, and so that you can search your documents. And every time you search, Google also saves your queries. The company can combine this data with other information it collects, such as your location, name, and phone number.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Advertising&lt;/h3&gt;\n\n\n\n&lt;p&gt;Google doesn&amp;#8217;t use the content you store in Google Docs for advertising. &lt;a href=\"https://support.google.com/docs/answer/10381817\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;According&lt;/a&gt; to the company, it doesn’t share your &lt;a href=\"https://proton.me/blog/personal-data\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;personally identifiable information&lt;/a&gt; with advertisers unless you ask them to, like selecting the call button to call a shop straight from your browser.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;AI training&lt;/h3&gt;\n\n\n\n&lt;p&gt;There’s nothing in Google’s &lt;a href=\"https://policies.google.com/privacy\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;privacy policy&lt;/a&gt; that prevents the company from using the content you create, upload, or receive (including Google Docs) and publicly available information to train their AI models. If you want to be absolutely certain your data isn’t being ingested into Google’s training models, the only solution would be to stop using Google services.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Third-party access&lt;/h3&gt;\n\n\n\n&lt;p&gt;As with any other app, integrating Google Docs with third-party add-ons raises concerns since their privacy policies may differ from Google&amp;#8217;s. For instance, a third-party add-on could see your personal information and use it for analytics or to show ads. It may also &lt;a href=\"https://support.google.com/marketplace/answer/180490\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;expose your data to third parties&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"How-to-increase-your-Google-Docs-security\"&gt;How to increase your Google Docs security&lt;/h2&gt;\n\n\n\n&lt;p&gt;Most security issues happen because users are not careful enough with their Google accounts, like &lt;strong&gt;failing to sign out when using a shared computer&lt;/strong&gt;. Check out the following tips to stay safe when using Google Docs:&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;1. Secure your Google account&lt;/h3&gt;\n\n\n\n&lt;p&gt;Protect your Google account with a &lt;a href=\"https://proton.me/blog/create-remember-strong-passwords\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;strong password&lt;/a&gt; to prevent hackers from decrypting it in a data breach. You should also enable &lt;a href=\"https://proton.me/blog/what-is-two-factor-authentication-2fa\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;two-factor authentication (2FA)&lt;/a&gt; to add another layer of defense in case someone learns your password. Setting up a &lt;a href=\"https://proton.me/blog/what-is-a-passkey\"&gt;passkey&lt;/a&gt; offers even better security.&lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://proton.me/pass\"&gt;Proton Pass&lt;/a&gt; is a secure password manager that offers a &lt;a href=\"https://proton.me/pass/password-generator\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;random password generator&lt;/a&gt;, &lt;a href=\"https://proton.me/support/pass-2fa\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;authenticator for 2FA&lt;/a&gt;, and support for &lt;a href=\"https://proton.me/support/pass-use-passkeys\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;passkeys&lt;/a&gt;, so you can use it to enhance the protection of your Google account.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;2. Be mindful of your Google account&lt;/h3&gt;\n\n\n\n&lt;p&gt;Google has been known to &lt;a href=\"https://support.google.com/accounts/answer/40695\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;disable accounts&lt;/a&gt; for perceived violations of its &lt;a href=\"https://policies.google.com/terms\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;terms of service&lt;/a&gt; for Docs or any other Google product. So, for example, if you break a rule on YouTube, you might also lose access to your documents, emails, or any other Google service. Sometimes the company’s automated systems can &lt;a href=\"https://www.nytimes.com/2022/08/21/technology/google-surveillance-toddler-photo.html\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;wrongly flag&lt;/a&gt; you.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;3. Control who can access your documents&lt;/h3&gt;\n\n\n\n&lt;p&gt;Avoid sharing documents using the “Anyone on the internet” setting unless you are comfortable with them becoming publicly available information. When sharing documents, use restricted sharing options for specific people rather than broad access levels. Additionally, you can check the activity dashboard to see who has accessed your documents and when.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;4. Check the permissions of third-party add-ons&lt;/h3&gt;\n\n\n\n&lt;p&gt;Before installing a third-party add-on from Google Marketplace, check the Permissions tab to see what data it collects and how it processes it. You can also look over its privacy policy and check if the app is independently audited.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;5. Encrypt your documents&lt;/h3&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://support.google.com/docs/answer/10519333\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Google work or school accounts&lt;/a&gt; can create new encrypted documents and encrypt documents before uploading them if the admin enabled client-side encryption. It&amp;#8217;s also possible to collaborate on encrypted docs. However, free Google accounts can&amp;#8217;t use this encryption feature. It’s far easier to use a service that stores documents using end-to-end encryption by default, such as &lt;a href=\"https://proton.me/drive\"&gt;Proton Drive&lt;/a&gt;.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;6. Back up your important documents&lt;/h3&gt;\n\n\n\n&lt;p&gt;In 2023, many people &lt;a href=\"https://support.google.com/drive/thread/245055606/google-drive-files-suddenly-disappeared-the-drive-literally-went-back-to-condition-in-may-2023\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;reported&lt;/a&gt; significant data losses with Google Drive, which underscores the need to &lt;a href=\"https://proton.me/blog/how-to-back-up-files\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;back up important files&lt;/a&gt;. Fortunately, the company makes it easy to &lt;a href=\"https://takeout.google.com/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;download your Google data&lt;/a&gt; and back it up or move it to another cloud storage service.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"Secure-your-data-with-Proton-Drive\"&gt;Secure your data with Proton Docs&lt;/h2&gt;\n\n\n\n&lt;p&gt;Proton has now launched Proton Docs, a secure end-to-end encrypted fully-featured Google Docs alternative that respects your privacy. &lt;/p&gt;\n\n\n&lt;div class=\"wp-block-image\"&gt;\n&lt;figure class=\"aligncenter size-full\"&gt;&lt;img width=\"1024\" height=\"512\" data-public-id=\"wp-pme/proton-docs-blog-2-collaboration2x_76086dfea5/proton-docs-blog-2-collaboration2x_76086dfea5.webp\" loading=\"lazy\" decoding=\"async\" src=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_512,c_scale/f_auto,q_auto/v1720190672/wp-pme/proton-docs-blog-2-collaboration2x_76086dfea5/proton-docs-blog-2-collaboration2x_76086dfea5.webp?_i=AA\" alt=\"\" class=\"wp-post-75819 wp-image-76086\" data-format=\"webp\" data-transformations=\"f_auto,q_auto\" data-version=\"1720190672\" data-seo=\"1\" srcset=\"https://res.cloudinary.com/dbulfrlrz/images/f_auto,q_auto/v1720190672/wp-pme/proton-docs-blog-2-collaboration2x_76086dfea5/proton-docs-blog-2-collaboration2x_76086dfea5.webp?_i=AA 1024w, https://res.cloudinary.com/dbulfrlrz/images/w_300,h_150,c_scale/f_auto,q_auto/v1720190672/wp-pme/proton-docs-blog-2-collaboration2x_76086dfea5/proton-docs-blog-2-collaboration2x_76086dfea5.webp?_i=AA 300w, https://res.cloudinary.com/dbulfrlrz/images/w_768,h_384,c_scale/f_auto,q_auto/v1720190672/wp-pme/proton-docs-blog-2-collaboration2x_76086dfea5/proton-docs-blog-2-collaboration2x_76086dfea5.webp?_i=AA 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /&gt;&lt;/figure&gt;&lt;/div&gt;\n\n\n&lt;p&gt;&lt;a href=\"https://proton.me/blog/docs-proton-drive\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;&lt;strong&gt;Learn more about Proton Docs&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;\n\n\n\n&lt;p&gt;Proton Docs is accessed through &lt;a href=\"https://proton.me/drive\"&gt;Proton Drive&lt;/a&gt;, and is free to everyone — just sign up for a free Proton Drive account.&lt;/p&gt;\n\n\n\n&lt;div class=\"text-center\"&gt;&lt;a class=\"btn inline-block rounded-full font-bold btn-small bg-purple-500 text-white hover:text-white focus:text-white\" href=\"/https://proton.me/drive/pricing\"&gt;Get Proton Drive&lt;/a&gt;&lt;/div&gt;\n\n\n\n&lt;p&gt;If you already have Proton Drive and want to experience Proton Docs, just log in to &lt;a href=\"https://docs.proton.me\"&gt;docs.proton.me&lt;/a&gt; using your Proton Account username and password (plus 2FA, if configured) and select &lt;strong&gt;+&lt;/strong&gt; &lt;strong&gt;New&lt;/strong&gt; → &lt;strong&gt;New document&lt;/strong&gt;. &lt;/p&gt;\n\n\n\n&lt;p&gt;Proton Drive is a safer alternative to Google Drive for cloud storage and collaboration since we use &lt;a href=\"https://proton.me/security/end-to-end-encryption\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;end-to-end encryption&lt;/a&gt; to ensure no one can see your private data — not even us. All files are automatically encrypted before upload.&lt;/p&gt;\n\n\n\n&lt;p&gt;Proton Drive lets you &lt;a href=\"https://proton.me/drive/file-sharing\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;securely share files&lt;/a&gt; and with anyone, even non-Proton users. You can set expiration dates for shared files, allow viewing or editing, protect links with passwords, easily &lt;a href=\"https://proton.me/support/drive-how-to-share-files-via-email\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;share files via email&lt;/a&gt;, and track how many times your files were downloaded.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\" id=\"proton-defends-you\"&gt;Google spies on your data – Proton defends it&lt;/h2&gt;\n\n\n\n&lt;p&gt;Moving away from Google means finding a provider you can trust with your data, so you won&amp;#8217;t have to worry about privacy violations. Millions of people worldwide trust Proton with their internet privacy, including journalists and activists.&lt;/p&gt;\n\n\n\n&lt;p&gt;Unlike Google, Proton doesn&amp;#8217;t use your data to make money — we are exclusively funded by our community of subscribers and primarily &lt;a href=\"https://proton.me/blog/proton-non-profit-foundation\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;owned by a nonprofit&lt;/a&gt; focused on promoting online privacy for all. Additionally, we operate under &lt;a href=\"https://proton.me/blog/switzerland\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;strong Swiss privacy laws&lt;/a&gt;. All our apps are &lt;a href=\"https://proton.me/community/open-source\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;open source&lt;/a&gt; and independently audited.&lt;/p&gt;\n\n\n\n&lt;p&gt;Signing up for a Proton account means gaining access to an encrypted ecosystem designed to protect all your data, including &lt;a href=\"https://proton.me/drive\"&gt;cloud storage&lt;/a&gt;, &lt;a href=\"https://proton.me/pass\"&gt;passwords&lt;/a&gt;, &lt;a href=\"https://protonvpn.com/?ref=prdmenuvpn\"&gt;internet connection&lt;/a&gt;, &lt;a href=\"https://proton.me/mail\"&gt;email&lt;/a&gt;, and &lt;a href=\"https://proton.me/calendar\"&gt;calendar&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Frequently asked questions&lt;/h2&gt;\n\n\n\n&lt;div class=\"schema-faq wp-block-yoast-faq-block\"&gt;&lt;div class=\"schema-faq-section\" id=\"faq-question-1719386555643\"&gt;&lt;strong class=\"schema-faq-question\"&gt;How to make Google Docs secure?&lt;/strong&gt; &lt;p class=\"schema-faq-answer\"&gt;You can improve your privacy and security when using Google Docs by using strong passwords and 2FA or passkeys for your Google account. You should also manage who can access your documents, check the permissions of third-party add-ons, and encrypt your documents before uploading them to Google Drive.&lt;/p&gt; &lt;/div&gt; &lt;div class=\"schema-faq-section\" id=\"faq-question-1719386563275\"&gt;&lt;strong class=\"schema-faq-question\"&gt;What are three disadvantages of Google Docs?&lt;/strong&gt; &lt;p class=\"schema-faq-answer\"&gt;The biggest concern with Google Docs is that Google can see your documents since it doesn&amp;#8217;t use end-to-end encryption. You could also lose access to your account if Google suspects you broke its terms of service, which means losing important documents if you haven&amp;#8217;t backed them up elsewhere. Additionally, nothing in Google&amp;#8217;s policies prevents them from freely using your documents to train AI models without your consent.&lt;/p&gt; &lt;/div&gt; &lt;div class=\"schema-faq-section\" id=\"faq-question-1719386572308\"&gt;&lt;strong class=\"schema-faq-question\"&gt;Is it safe to keep passwords in Google Docs?&lt;/strong&gt; &lt;p class=\"schema-faq-answer\"&gt;Google doesn&amp;#8217;t use end-to-end encryption, so the company and its employees can see your passwords. If you use third-party add-ons with Google Drive, those may see your passwords, too. Additionally, Google can disable your account if it thinks you violated its terms of service when using any of its products. There are also other risks involved, like someone looking over your shoulder in a public place and taking a photo of your screen. Or you may fall victim to clipboard hijacking attacks. A password manager like &lt;a href=\"https://proton.me/pass\"&gt;Proton Pass&lt;/a&gt; is more convenient for keeping passwords. Proton Pass uses end-to-end encryption to ensure no one can see your passwords.&lt;/p&gt; &lt;/div&gt; &lt;div class=\"schema-faq-section\" id=\"faq-question-1719386586920\"&gt;&lt;strong class=\"schema-faq-question\"&gt;Is Google Docs secure for medical records?&lt;/strong&gt; &lt;p class=\"schema-faq-answer\"&gt;Google Workspace is HIPAA compliant, so healthcare providers in the United States can use Google Docs to share medical records. However, your data is only as secure as your Google account, so be sure to use strong passwords and enable 2FA (or use passkeys). &lt;a href=\"https://proton.me/blog/is-google-drive-secure\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Google Drive doesn&amp;#8217;t use end-to-end encryption&lt;/a&gt;, so the company can see your medical records. If you don&amp;#8217;t feel comfortable with this, you should encrypt your files before uploading them to Google Drive. Or you can use &lt;a href=\"https://proton.me/drive\"&gt;Proton Drive&lt;/a&gt; to encrypt shared links with a password.&lt;/p&gt; &lt;/div&gt; &lt;/div&gt;\n   </content:encoded>\n   <category>\n    Privacy guides\n   </category>\n   <author>\n    Elena Constantinescu\n   </author>\n  </item>\n  <item>\n   <title>\n    Introducing Docs in Proton Drive – collaborative document editing that’s actually private\n   </title>\n   <link/>\n   https://proton.me/blog/docs-proton-drive\n   <guid ispermalink=\"true\">\n    https://proton.me/blog/docs-proton-drive\n   </guid>\n   <description>\n    Create docs and collaborate in real time on documents knowing they are end-to-end encrypted.\n   </description>\n   <pubdate>\n    Wed, 03 Jul 2024 10:03:59 GMT\n   </pubdate>\n   <content:encoded>\n    &lt;p&gt;Billions of people use online document editors like Google Docs or Microsoft 365 to write reports, collaborate on projects, and keep track of meeting notes. But there is a growing concern about Big Tech platforms having access to your content, tracking you across the web, and collecting data to train privacy-invading AI models.&lt;/p&gt;\n\n\n\n&lt;p&gt;Today we’re announcing &lt;strong&gt;a new end-to-end encrypted, collaborative document editor&lt;/strong&gt; that puts your privacy first. Docs in Proton Drive are built on the same privacy and security principles as all our services, starting with end-to-end encryption. Docs let you collaborate in real time, leave comments, add photos, and store your files securely. Best of all, it’s all private — even keystrokes and cursor movements are encrypted.&lt;/p&gt;\n\n\n\n&lt;p&gt;Get started by &lt;a href=\"https://account.proton.me/drive/signup\"&gt;creating a free Proton Drive account today&lt;/a&gt; (if you don’t already have one). We are rolling out Docs starting today, and the feature will be available to all users over the next couple of days. At that time, if you go to &lt;a href=\"http://drive.proton.me/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;drive.proton.me&lt;/a&gt; and click on &lt;em&gt;New&lt;/em&gt; in the top left, you will see the ability to create a New document.&lt;/p&gt;\n\n\n\n&lt;figure class=\"wp-block-image size-large\"&gt;&lt;img width=\"2400\" height=\"1200\" data-public-id=\"wp-pme/proton-docs-blog-3-encryption2x/proton-docs-blog-3-encryption2x.png\" loading=\"lazy\" decoding=\"async\" src=\"https://res.cloudinary.com/dbulfrlrz/images/w_2400,h_1200,c_scale/f_auto,q_auto/v1719985740/wp-pme/proton-docs-blog-3-encryption2x/proton-docs-blog-3-encryption2x.png?_i=AA\" alt=\"\" class=\"wp-post-75839 wp-image-75840\" data-format=\"png\" data-transformations=\"f_auto,q_auto\" data-filesize=\"2 MB\" data-optsize=\"108 KB\" data-optformat=\"image/webp\" data-percent=\"93.9\" data-permalink=\"https://pme.protonblog.tech/wp-admin/admin.php?page=cloudinary&amp;amp;section=edit-asset&amp;amp;asset=75840\" data-version=\"1719985740\" data-seo=\"1\" srcset=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_512,c_scale/f_auto,q_auto/v1719985740/wp-pme/proton-docs-blog-3-encryption2x/proton-docs-blog-3-encryption2x.png?_i=AA 1024w, https://res.cloudinary.com/dbulfrlrz/images/w_300,h_150,c_scale/f_auto,q_auto/v1719985740/wp-pme/proton-docs-blog-3-encryption2x/proton-docs-blog-3-encryption2x.png?_i=AA 300w, https://res.cloudinary.com/dbulfrlrz/images/w_768,h_384,c_scale/f_auto,q_auto/v1719985740/wp-pme/proton-docs-blog-3-encryption2x/proton-docs-blog-3-encryption2x.png?_i=AA 768w, https://res.cloudinary.com/dbulfrlrz/images/w_1536,h_768,c_scale/f_auto,q_auto/v1719985740/wp-pme/proton-docs-blog-3-encryption2x/proton-docs-blog-3-encryption2x.png?_i=AA 1536w, https://res.cloudinary.com/dbulfrlrz/images/w_2048,h_1024,c_scale/f_auto,q_auto/v1719985740/wp-pme/proton-docs-blog-3-encryption2x/proton-docs-blog-3-encryption2x.png?_i=AA 2048w, https://res.cloudinary.com/dbulfrlrz/images/w_1568,h_784,c_scale/f_auto,q_auto/v1719985740/wp-pme/proton-docs-blog-3-encryption2x/proton-docs-blog-3-encryption2x.png?_i=AA 1568w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /&gt;&lt;/figure&gt;\n\n\n\n&lt;div class=\"text-center\"&gt;&lt;a class=\"btn inline-block rounded-full font-bold btn-small btn-solid-purple\" href=\"https://account.proton.me/drive/signup\"&gt;Get Proton Drive&lt;/a&gt;&lt;/div&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Why we’re launching a privacy-first document editor&lt;/h2&gt;\n\n\n\n&lt;p&gt;Online document editors have become a core productivity tool, used for everything from private journals to sensitive business strategies. The problem is that most companies offering document editors today are the same Big Tech companies that collect and monetize your private information.&lt;/p&gt;\n\n\n\n&lt;p&gt;As a result, there are multiple significant issues:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mass data collection&lt;/strong&gt;— Document editors such as Google Docs can see everything you write and keep a record of all changes that you have ever made. Once you provide your data to these companies, you no longer have control over how it is used. &lt;strong&gt;Data that you think is private may even be used to train AI in the future&lt;/strong&gt;.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Risk of data breaches&lt;/strong&gt; — No major document editor protects your data with &lt;a href=\"https://proton.me/blog/what-is-end-to-end-encryption\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;end-to-end encryption&lt;/a&gt; by default, which leaves your documents vulnerable to hackers and data breaches. When companies can decrypt your data, it’s like leaving the key next to the safe.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Weak privacy laws&lt;/strong&gt; —&amp;nbsp;Tech companies with headquarters and data centers in the US are subject to bulk surveillance and lax data protection laws.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Third-party and government access&lt;/strong&gt; —&amp;nbsp;Without end-to-end encryption or strong legal protections, your documents are subject to &lt;a href=\"https://proton.me/blog/us-warrantless-surveillance\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;warrantless surveillance&lt;/a&gt; and &lt;a href=\"https://policies.google.com/privacy?hl=en-US#infosharing\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;data sharing&lt;/a&gt;.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;When you write in a document, you would like to think your ideas are only for you and the people you choose to share with. But that’s not really the case.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Bringing Proton privacy to collaborative online documents&lt;/h2&gt;\n\n\n\n&lt;p&gt;We built docs in Proton Drive as a joint project &lt;a href=\"https://proton.me/blog/proton-standard-notes-join-forces\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;with the team from Standard Notes&lt;/a&gt;, who share our core values around privacy and security.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;As with all Proton services, Docs put you back in control of your data. Thanks to our open-source end-to-end encryption, you are the only one with the key to read and share your documents. Not even Proton can access your docs content or metadata (such as file names). Instead of storing your data in the US, where it can be subject to government surveillance, Proton is protected by &lt;a href=\"https://proton.me/blog/switzerland\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;strict Swiss privacy laws&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;p&gt;Docs are integrated into your Proton Drive, meaning you have a unified and secure space for your document management and storage. We designed Docs to be a clean, simple experience. With Docs you can:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Write with privacy &lt;/strong&gt;—&lt;strong&gt; &lt;/strong&gt;Create and edit documents within Proton Drive, knowing your contents are only accessible to you and those you choose to share with.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Share and invite anyone —&lt;/strong&gt; Invite other users to view or edit your documents with a single click.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Collaborate in real-time &lt;/strong&gt;— Changes are reflected immediately, ensuring every contributor always sees the most up-to-date version.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;View cursors and presence indicators&lt;/strong&gt; — See who else is viewing or editing the document, enhancing teamwork and communication.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Leave comments and replies &lt;/strong&gt;— Add comments to share feedback without editing the document. Comments are visible to all collaborators, keeping everyone in the loop.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Import and export with ease — &lt;/strong&gt;You can upload .docx documents, edit them, and download in various formats like .docx, .txt, .md, and HTML.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;figure class=\"wp-block-image size-large\"&gt;&lt;img width=\"2401\" height=\"1200\" data-public-id=\"wp-pme/proton-docs-blog-2-collaboration2x/proton-docs-blog-2-collaboration2x.png\" loading=\"lazy\" decoding=\"async\" src=\"https://res.cloudinary.com/dbulfrlrz/images/w_2401,h_1200,c_scale/f_auto,q_auto/v1719985722/wp-pme/proton-docs-blog-2-collaboration2x/proton-docs-blog-2-collaboration2x.png?_i=AA\" alt=\"\" class=\"wp-post-75839 wp-image-75844\" data-format=\"png\" data-transformations=\"f_auto,q_auto\" data-filesize=\"1 MB\" data-optsize=\"137 KB\" data-optformat=\"image/webp\" data-percent=\"87.7\" data-permalink=\"https://pme.protonblog.tech/wp-admin/admin.php?page=cloudinary&amp;amp;section=edit-asset&amp;amp;asset=75844\" data-version=\"1719985722\" data-seo=\"1\" srcset=\"https://res.cloudinary.com/dbulfrlrz/images/w_1024,h_512,c_scale/f_auto,q_auto/v1719985722/wp-pme/proton-docs-blog-2-collaboration2x/proton-docs-blog-2-collaboration2x.png?_i=AA 1024w, https://res.cloudinary.com/dbulfrlrz/images/w_300,h_150,c_scale/f_auto,q_auto/v1719985722/wp-pme/proton-docs-blog-2-collaboration2x/proton-docs-blog-2-collaboration2x.png?_i=AA 300w, https://res.cloudinary.com/dbulfrlrz/images/w_768,h_384,c_scale/f_auto,q_auto/v1719985722/wp-pme/proton-docs-blog-2-collaboration2x/proton-docs-blog-2-collaboration2x.png?_i=AA 768w, https://res.cloudinary.com/dbulfrlrz/images/w_1536,h_768,c_scale/f_auto,q_auto/v1719985722/wp-pme/proton-docs-blog-2-collaboration2x/proton-docs-blog-2-collaboration2x.png?_i=AA 1536w, https://res.cloudinary.com/dbulfrlrz/images/w_2048,h_1024,c_scale/f_auto,q_auto/v1719985722/wp-pme/proton-docs-blog-2-collaboration2x/proton-docs-blog-2-collaboration2x.png?_i=AA 2048w, https://res.cloudinary.com/dbulfrlrz/images/w_1568,h_784,c_scale/f_auto,q_auto/v1719985722/wp-pme/proton-docs-blog-2-collaboration2x/proton-docs-blog-2-collaboration2x.png?_i=AA 1568w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /&gt;&lt;/figure&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;A complete privacy-first ecosystem&lt;/h2&gt;\n\n\n\n&lt;p&gt;Far too often, online productivity suites require you to accept surveillance as a condition of use. Docs is a milestone in our journey to building a better internet where privacy is the default. It is the first collaborative document editor that combines open source end-to-end encryption within a secure ecosystem that includes email, cloud storage, calendar, and more, so you can break away from Big Tech services that exploit your data. This is another important step toward advancing the mission of the &lt;a href=\"https://proton.me/foundation\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;nonprofit Proton Foundation.&lt;/a&gt;&lt;/p&gt;\n\n\n\n&lt;p&gt;With Proton Drive and Docs, you now have a secure, privacy-first cloud storage and productivity alternative. If you’re working in law firms or healthcare, you can draft contracts and manage patient data in compliance with privacy laws. Journalists, content creators, and entrepreneurs can keep their projects protected from data leaks and Big Tech surveillance (no AI snooping on your work). Whether for work or for personal use, Proton Drive ensures your documents remain safe and private.&lt;/p&gt;\n\n\n\n&lt;p&gt;We&amp;#8217;re excited to see how you will benefit from the robust privacy protections that Docs offer. Ready to get started? &lt;a href=\"https://account.proton.me/drive/signup?plan=free\"&gt;Check out Docs in Proton Drive&lt;/a&gt; and start collaborating privately.&lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;strong&gt;To get the best experience in Docs, please be sure to &lt;a href=\"https://proton.me/drive/download\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;update your Proton Drive app&lt;/a&gt; to the latest version on desktop and mobile.&lt;/strong&gt;&lt;/p&gt;\n   </content:encoded>\n   <category>\n    Product updates\n   </category>\n   <category>\n    Proton Drive\n   </category>\n   <author>\n    Anant Vijay\n   </author>\n  </item>\n  <item>\n   <title>\n    Is it safe to let your password manager autofill your password?\n   </title>\n   <link/>\n   https://proton.me/blog/safe-to-autofill-passwords\n   <guid ispermalink=\"true\">\n    https://proton.me/blog/safe-to-autofill-passwords\n   </guid>\n   <description>\n    Using autofill to complete online forms is fast and easy, but be aware of hacking tactics that exploit this convenience.\n   </description>\n   <pubdate>\n    Tue, 02 Jul 2024 04:49:03 GMT\n   </pubdate>\n   <content:encoded>\n    &lt;p&gt;Struggling to keep track of all your passwords? You’re not the only one. &lt;a href=\"https://proton.me/blog/what-is-a-password-manager\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Password managers&lt;/a&gt; exist because it’s difficult to keep track of hundreds of logins and all their various passwords. It’s likely you have saved passwords on your devices for convenience: You might use the password manager built into your browser, software offered by a third party, or one of the cloud-based password managers working across multiple devices like &lt;a href=\"https://proton.me/blog/is-icloud-keychain-safe\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;iCloud&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;p&gt;A good password manager can &lt;a href=\"https://proton.me/pass/password-generator\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;suggest secure passwords&lt;/a&gt;, store all of your login credentials safely, and then autofill fields instantly so you don’t need to type in your login details each time. They’re a very useful tool, and one that can help you strengthen your online safety if used correctly. However, there are some safety tips you should be aware of if you want to stay extra secure. In this article we’ll focus on how password autofill can affect your online security. &lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Is using a password manager safe?&lt;/h2&gt;\n\n\n\n&lt;p&gt;First, let’s understand how a password manager works. Think of your password manager like a bank vault: It’s full of valuable resources, and both you and your service provider are responsible for protecting access to it. You can protect yourself by creating a &lt;a href=\"https://proton.me/blog/what-is-passphrase\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;strong master password or passphrase&lt;/a&gt; and using &lt;a href=\"https://proton.me/blog/what-is-two-factor-authentication-2fa\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;two-factor authentication (2FA)&lt;/a&gt;. Your password manager can then store and protect those passwords. &lt;/p&gt;\n\n\n\n&lt;p&gt;One of the ways a password manager protects your data is by encrypting it using an &lt;a href=\"https://proton.me/blog/what-is-encryption\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;encryption algorithm&lt;/a&gt;. All your logins, passwords, payment methods, notes and other data will only be accessible to you and the password manager’s servers. Some services offer the more secure option of &lt;a href=\"https://proton.me/blog/what-is-end-to-end-encryption\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;end-to-end encryption&lt;/a&gt;, which prevents the company from accessing your data and ensuring only you can see it. When you’re choosing a password manager, it’s safest to choose one which offers end-to-end encryption, &lt;a href=\"https://proton.me/blog/proton-pass-security-model\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;including of metadata&lt;/a&gt;. Proton Pass offers &lt;a href=\"https://proton.me/pass/security\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;end-to-end encryption&lt;/a&gt; which makes all of your data and metadata unreadable when it’s stored in your vault. No-one can access it, not even Proton. &lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;How does password autofill work?&lt;/h2&gt;\n\n\n\n&lt;p&gt;Autofill is a feature in many password managers that lets you automatically populate fields on a website so you don’t have to manually type them in. Fields can include your username and password, but also your bank card details, 2FA code, and other data.&lt;/p&gt;\n\n\n\n&lt;p&gt;Generally speaking, password autofill is either automated or manual. When autofill is automated, your saved login and password will populate in the relevant fields of a website you’ve saved credentials for. When autofill is manual, your password manager will wait for you to interact with the fields by clicking or typing before it will autofill your password.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Password autofill risks&lt;/h2&gt;\n\n\n\n&lt;p&gt;Using automated password autofill means you don’t have to think about entering your credentials, but this is risky. Autofill will automatically fill &lt;em&gt;any &lt;/em&gt;field on a webpage without your permission. For example, a malicious landing page may have multiple invisible fields which hackers can use to convince your password manager to autofill with your credentials. This can happen without your knowledge, and multiple passwords can be compromised by a single landing page.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;This is a well-known attack called an &lt;a href=\"https://www.forbes.com/sites/daveywinder/2023/12/11/android-warning-1password-dashlane-lastpass-and-others-can-leak-passwords/\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;AutoSpill exploit&lt;/a&gt;. In 2023, many password managers were confirmed to have been compromised using this exact exploit, including 1Password, LastPass, Enpass, Keeper, and Keepass2Android. It’s a vulnerability that many password managers simply didn’t have a rigorous enough autofill policy to combat. &lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;strong&gt;But it’s actually incredibly easy to avoid.&lt;/strong&gt; All you need to do is turn on manual autofill.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;Your password manager will always run background checks, examining the domain and verifying that no phishing elements are present. But using manual autofill creates an extra layer of security because it gives you a chance to check that you’re on the right website.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://proton.me/pass\"&gt;Proton Pass&lt;/a&gt; uses manual autofill by default and only populates fields on domains you already trust.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;How can I keep my passwords safe?&amp;nbsp;&lt;/h2&gt;\n\n\n\n&lt;p&gt;Ultimately, it’s up to you to make sure you’re staying safe online. One of the best ways you can do that is to use a trusted, &lt;a href=\"https://proton.me/pass\"&gt;secure password manager&lt;/a&gt;. Along with manual autofill, end-to-end encryption, and secure password suggestion, reliable password management software should offer:&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;The option to create passkeys&lt;/h3&gt;\n\n\n\n&lt;p&gt;&lt;a href=\"https://proton.me/pass/passkeys\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Passkeys&lt;/a&gt; make it possible for you to verify your identity online without using a password or passphrase. This means that instead of using a specific password, you can create a digital credential that’s tied to your logged in device. In effect, your password manager becomes the authenticator rather than your password. This is sometimes a more secure option than a password, but not every platform supports them. &lt;strong&gt;Proton Pass gives you the option to use passkeys when available.&lt;/strong&gt;&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Proactive protection&lt;/h3&gt;\n\n\n\n&lt;p&gt;In the background, your password manager needs to be aware of data breaches and potentially compromised websites. &lt;a href=\"https://proton.me/pass/pass-monitor\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Pass Monitor in Proton Pass&lt;/a&gt; scans the dark web for you to ensure none of your credentials have leaked, flagging any weak or repeated passwords, and preventing hackers from ever being able to access your account even if they’ve acquired some of your information. &lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Identity management&lt;/h3&gt;\n\n\n\n&lt;p&gt;Your personal email address is almost like your online passport. A good password manager will not only protect the data and metadata that you save, it’ll help you &lt;a href=\"https://proton.me/pass/aliases\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;create email aliases&lt;/a&gt; which forward emails into your inbox. Proton Pass easily generates hide-my-email aliases that can’t be connected to you, putting an extra layer of safety between hackers and your personal email address. If an alias address is compromised, all you’ll need to do is deactivate it. &lt;/p&gt;\n\n\n\n&lt;p&gt;Proton Pass is the only password manager that offers complete identity protection, using end-to-end encryption built by scientists at CERN. With Proton Pass, you’ll have access to:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;A built-in 2FA authenticator&lt;/li&gt;\n\n\n\n&lt;li&gt;Passkey authentication&lt;/li&gt;\n\n\n\n&lt;li&gt;Email aliases&lt;/li&gt;\n\n\n\n&lt;li&gt;Dark web and data breach scanning with &lt;a href=\"https://proton.me/pass/pass-monitor\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Pass Monitor&lt;/a&gt; (available in Pass Plus)&lt;/li&gt;\n\n\n\n&lt;li&gt;Defense against account takeovers with &lt;a href=\"https://proton.me/blog/sentinel-included-pass-plus\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Pass Sentinel&lt;/a&gt; (available in Pass Plus)&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;a href=\"https://proton.me/pass/password-sharing\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Secure password sharing&lt;/a&gt;&lt;/li&gt;\n\n\n\n&lt;li&gt;Support for unlimited devices, logins, and notes&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;p&gt;Take the first step in protecting your passwords today. &lt;a href=\"https://account.proton.me/pass/signup\"&gt;Get Proton Pass.&lt;/a&gt;&lt;/p&gt;\n   </content:encoded>\n   <category>\n    Privacy guides\n   </category>\n   <author>\n    Elena Constantinescu\n   </author>\n  </item>\n  <item>\n   <title>\n    What is shoulder surfing and how to prevent it?\n   </title>\n   <link/>\n   https://proton.me/blog/shoulder-surfing\n   <guid ispermalink=\"true\">\n    https://proton.me/blog/shoulder-surfing\n   </guid>\n   <description>\n    Learn what shoulder surfing means, and take precautions to stay safe when using your devices in public spots.\n   </description>\n   <pubdate>\n    Wed, 26 Jun 2024 08:31:00 GMT\n   </pubdate>\n   <content:encoded>\n    &lt;p&gt;&lt;a href=\"https://protonvpn.com/blog/types-of-cyberattacks\"&gt;Cyberattacks&lt;/a&gt; aren&amp;#8217;t always executed through sophisticated methods like man-in-the-middle (MITM) attacks on &lt;a href=\"https://protonvpn.com/blog/public-wifi-safety\"&gt;public WiFi&lt;/a&gt;. Sometimes, they rely on something as simple as looking over your shoulder.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;Shoulder surfing attacks are when someone watches you enter sensitive information on your device and uses it to gain unauthorized access. It&amp;#8217;s a reminder that despite our advanced technology, we still need simple precautions to stay safe.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Shoulder surfing meaning&lt;/h2&gt;\n\n\n\n&lt;p&gt;Shoulder surfing is a type of &lt;a href=\"https://proton.me/blog/what-is-social-engineering\"&gt;social engineering&lt;/a&gt; attack in which the attacker physically spies on someone to obtain confidential information such as passwords, PINs, or other sensitive data. This can be done by watching someone or listening to confidential information being spoken (eavesdropping).&lt;/p&gt;\n\n\n\n&lt;p&gt;A thief could be directly observing you from close distance or use sophisticated methods, such as binoculars, hidden cameras, or smartphones, to capture your information from a distance and remain undetected.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;How shoulder surfing can affect you&lt;/h2&gt;\n\n\n\n&lt;p&gt;Shoulder surfing attacks can have serious consequences. For example, if a thief sees your email and password, they can use them to hack into your accounts, &lt;a href=\"https://proton.me/blog/types-of-identity-theft\"&gt;steal your identity&lt;/a&gt;, or sell your information on the &lt;a href=\"https://proton.me/blog/what-is-dark-web\"&gt;dark web&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;p&gt;By getting hold of your &lt;a href=\"https://proton.me/blog/what-to-do-if-someone-has-your-social-security-number\"&gt;Social Security number&lt;/a&gt;, home address, and birthday, a criminal could make unauthorized purchases, open new credit cards, apply for loans, or even commit crimes using your name. You would then have to deal with the fallout by trying to prove that it wasn&amp;#8217;t you.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Examples of shoulder surfing&lt;/h2&gt;\n\n\n\n&lt;p&gt;Shoulder surfing usually happens in public, crowded places because attackers can easily blend in and discreetly observe people entering sensitive information without arousing suspicion. Here are some examples:&lt;/p&gt;\n\n\n\n&lt;ul&gt;\n&lt;li&gt;In &lt;strong&gt;cafes&lt;/strong&gt;, people often use laptops, tablets, and smartphones for personal or work-related tasks, so a shoulder surfer might sit at a nearby table or walk past repeatedly. In 2019, a group of about 25 young women were &lt;a href=\"https://www.brusselstimes.com/85310/members-of-a-gang-of-shoulder-surfers-arrested-in-amsterdam\"&gt;arrested&lt;/a&gt; in Amsterdam for shoulder surfing in more than 100 incidents.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Airports &lt;/strong&gt;are filled with travelers frequently using their devices to check flight details, access banking services, or respond to work emails. A shoulder surfer could stand behind you in a queue.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Buses, trains, and subways&lt;/strong&gt; are crowded with passengers sitting closely next to each other. A shoulder surfer could sit or stand next to you or behind you. A 2017 &lt;a href=\"https://www.medien.ifi.lmu.de/pubdb/publications/pub/eiband2017chi/eiband2017chi.pdf\"&gt;study&lt;/a&gt; by LMU Munich found that 67% of shoulder surfing happens on public transport.&lt;/li&gt;\n\n\n\n&lt;li&gt;&lt;strong&gt;Shared workspaces&lt;/strong&gt; used by freelancers and remote employees are risky because you are often surrounded by strangers who could easily observe your screen while pretending to work on their devices.&lt;/li&gt;\n\n\n\n&lt;li&gt;Criminals frequently target &lt;strong&gt;ATMs&lt;/strong&gt; to capture PIN entries using binoculars or pinhole cameras without being noticed. For example, a man in LA was &lt;a href=\"https://www.justice.gov/usao-cdca/pr/la-man-convicted-atm-shoulder-surfing-allowed-him-withdraw-cash-after-bank-customers\"&gt;convicted&lt;/a&gt; of ATM shoulder surfing in 2018 for obtaining the PINs of unsuspecting bank customers.&lt;/li&gt;\n\n\n\n&lt;li&gt;At &lt;strong&gt;checkout counters&lt;/strong&gt;, especially during busy times, shoppers often enter their PINs or credit card information. A shoulder surfer might pose as another customer, closely observing the keypad as someone enters their details, or even use their smartphone to covertly record the information.&lt;/li&gt;\n&lt;/ul&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;How to prevent shoulder surfing&lt;/h2&gt;\n\n\n\n&lt;p&gt;Staying alert is important to avoid shoulder surfing attacks, but there are many specific ways to protect your privacy and security.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Be strategic with your surroundings&lt;/h3&gt;\n\n\n\n&lt;p&gt;Whenever you’re working with sensitive data in a public place, &lt;strong&gt;position yourself in a way that minimizes exposure to prying eyes&lt;/strong&gt;, such as sitting with your back to a wall. You can also use a physical barrier, such as a privacy hood or screen shield, to block others&amp;#8217; views.&lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;strong&gt;Shield your personal information&lt;/strong&gt; when entering your PIN at an ATM or grocery shop by covering it with your hand or moving your body. Avoid using your devices or disclosing sensitive information over the phone until you reach a less crowded area.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Make your devices more private&lt;/h3&gt;\n\n\n\n&lt;p&gt;In addition to being aware of your surroundings, you can make your device harder to look at. Rotate your device&amp;#8217;s screen away from potential onlookers behind or next to you. &lt;strong&gt;Dimming your screen&lt;/strong&gt; can make it harder for others to see your display from a distance.&lt;/p&gt;\n\n\n\n&lt;p&gt;In your device settings, you can &lt;strong&gt;configure your screen to auto-lock after being inactive for a couple minutes&lt;/strong&gt;. This is safer than 15 or 30 minutes, which is the default on many devices. That way if you leave your phone out or leave it behind, you’re less likely to have someone break into it.&lt;/p&gt;\n\n\n\n&lt;p&gt;Additionally, &lt;strong&gt;turn off notification previews on your lock screen&lt;/strong&gt; to prevent sensitive information from being seen by others around you.&lt;/p&gt;\n\n\n\n&lt;h3 class=\"wp-block-heading\"&gt;Improve your data security&lt;/h3&gt;\n\n\n\n&lt;p&gt;Your logins are your first line of defense against attacks. Create &lt;a href=\"https://proton.me/blog/auto-generate-password\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;strong, unique passwords&lt;/a&gt; since these are harder for shoulder surfers to catch and write down. &lt;strong&gt;Avoid reusing passwords across different accounts to minimize damage&lt;/strong&gt; in case of &lt;a href=\"https://proton.me/blog/breach-recommendations\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;data leaks&lt;/a&gt; and prevent &lt;a href=\"https://proton.me/blog/what-is-credential-stuffing-attack\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;credential stuffing attacks&lt;/a&gt;. If you suspect you might have been a victim of shoulder surfing, change your passwords immediately.&lt;/p&gt;\n\n\n\n&lt;p&gt;Crucially, you should &lt;strong&gt;enable &lt;/strong&gt;&lt;a href=\"https://proton.me/blog/what-is-two-factor-authentication-2fa\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;&lt;strong&gt;two-factor authentication (2FA)&lt;/strong&gt;&lt;/a&gt;&lt;strong&gt; on all your accounts&lt;/strong&gt; that support it. By requiring a second identification factor (a code on your authenticator app), you ensure that even if someone learns your password, they still wouldn’t be able to pass the second mode of verification. 2FA is particularly secure because the code changes frequently, making it much harder for anyone to steal and use it.&lt;/p&gt;\n\n\n\n&lt;p&gt;Set up fraud alerts and regularly check your bank statements and credit reports for any unauthorized activity. &lt;strong&gt;Monitor the web to see if your data was leaked&lt;/strong&gt;, and take action if necessary.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;How Proton Pass makes these steps easier&lt;/h2&gt;\n\n\n\n&lt;p&gt;Proton Pass is a secure password manager that can remember all your passwords and auto-fills them on any device, so you’ll never be caught by a shoulder surfer watching your keystrokes.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;It generates random, complex passwords, as well as &lt;a href=\"https://proton.me/support/pass-use-passkeys\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;passkeys&lt;/a&gt; to log in to online accounts without passwords.&lt;/p&gt;\n\n\n\n&lt;p&gt;Proton Pass also includes a &lt;a href=\"https://proton.me/support/pass-2fa\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;built-in 2FA authenticator&lt;/a&gt; to use with all your accounts that support 2FA. You can also use &lt;a href=\"https://proton.me/pass/pass-monitor\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;Pass Monitor&lt;/a&gt; to audit the security of all your accounts — it includes Password Health, which checks for weak or reused accounts, and Dark Web Monitoring, which notifies you immediately if your personal information is leaked on the web.&lt;/p&gt;\n\n\n\n&lt;p&gt;We protect your data with &lt;a href=\"https://proton.me/security/end-to-end-encryption\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;end-to-end encryption&lt;/a&gt; to ensure no one can read your data — not even us. All our apps are &lt;a href=\"https://proton.me/community/open-source\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;open source&lt;/a&gt; and independently audited.&lt;/p&gt;\n\n\n\n&lt;p&gt;Improve your online privacy and security by &lt;a href=\"https://proton.me/pass\"&gt;subscribing for a free Proton Pass account&lt;/a&gt;.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Frequently asked questions&lt;/h2&gt;\n\n\n\n&lt;div class=\"schema-faq wp-block-yoast-faq-block\"&gt;&lt;div class=\"schema-faq-section\" id=\"faq-question-1719206918693\"&gt;&lt;strong class=\"schema-faq-question\"&gt;What does no shoulder surfing mean?&lt;/strong&gt; &lt;p class=\"schema-faq-answer\"&gt;&amp;#8220;No shoulder surfing&amp;#8221; means taking precautions to prevent people from looking over your shoulder to see sensitive information you are entering on a device, such as passwords, PINs, or other private data. It signifies being aware of your surroundings and ensuring that no one can easily view your screen or keyboard to steal your personal information.&lt;/p&gt; &lt;/div&gt; &lt;div class=\"schema-faq-section\" id=\"faq-question-1719206934921\"&gt;&lt;strong class=\"schema-faq-question\"&gt;Is it illegal to shoulder surf?&lt;/strong&gt; &lt;p class=\"schema-faq-answer\"&gt;While the act of merely watching someone might not be a crime in itself, using that information to steal someone&amp;#8217;s identity, commit fraud, or gain unauthorized access to accounts or data is illegal. Any form of data theft or unauthorized access to personal information is considered a criminal act.&lt;/p&gt; &lt;/div&gt; &lt;div class=\"schema-faq-section\" id=\"faq-question-1719206944494\"&gt;&lt;strong class=\"schema-faq-question\"&gt;What is the difference between shoulder surfing and dumpster surfing?&lt;/strong&gt; &lt;p class=\"schema-faq-answer\"&gt;Shoulder surfing involves directly observing someone to obtain sensitive information by looking over their shoulder, usually in public places. In contrast, dumpster surfing (or dumpster diving) means to look into trash bins or dumpsters for valuable information like documents or electronic devices.&lt;/p&gt; &lt;/div&gt; &lt;/div&gt;\n   </content:encoded>\n   <category>\n    Privacy guides\n   </category>\n   <author>\n    Elena Constantinescu\n   </author>\n  </item>\n  <item>\n   <title>\n    Proton receives ISO 27001 certification\n   </title>\n   <link/>\n   https://proton.me/blog/iso-27001-certification\n   <guid ispermalink=\"true\">\n    https://proton.me/blog/iso-27001-certification\n   </guid>\n   <description>\n    In May 2024, Proton received an ISO 27001 certification, highlighting our commitment to security and user privacy. Here’s what comes next.\n   </description>\n   <pubdate>\n    Thu, 20 Jun 2024 14:57:53 GMT\n   </pubdate>\n   <content:encoded>\n    &lt;p&gt;Proton prioritizes our community’s privacy and data security in every aspect of our business.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;To further demonstrate our commitment, we underwent a rigorous external audit and – on May 2, 2024 – received our &lt;a href=\"https://www.iso.org/standard/27001\" target=\"_blank\" rel=\"noreferrer noopener\"&gt;ISO 27001&lt;/a&gt; certification. &lt;/p&gt;\n\n\n\n&lt;p&gt;As an organization founded by scientists who met at CERN, we see peer review and transparency as a cornerstone of our mission. That&amp;#8217;s why we make all our apps open source, allowing anyone to examine our code.&lt;/p&gt;\n\n\n\n&lt;p&gt;Here&amp;#8217;s what this latest certification means and what’s next for Proton.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;How we did it&amp;nbsp;&lt;/h2&gt;\n\n\n\n&lt;p&gt;At Proton, our philosophy is to focus first on good security and let compliance with standards and frameworks follow.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;Our philosophy was confirmed by the fact that, to comply with ISO 27001:2022, we only needed to formalize and document some of our current processes. No fundamental changes in how our business or teams operate were required. &lt;/p&gt;\n\n\n\n&lt;p&gt;This comprehensive audit spanned 14 days and involved over 15 dedicated teams, each thoroughly evaluating the information security management systems underlying all Proton products.&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;Basically, our security management operations were double-checked and validated by independent experts.&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;Why we did it&amp;nbsp;&lt;/h2&gt;\n\n\n\n&lt;p&gt;At Proton, we believe in building products our community can trust. We also believe that trust must be earned. As an organization founded and run by former scientists, we believe all claims must be not only investigated but verified, including our own&lt;/p&gt;\n\n\n\n&lt;p&gt;Transparency and peer review are the best ways to ensure systems function as they&amp;#8217;re supposed to and vulnerabilities are quickly resolved. This approach only becomes more important as we grow and add new services. This certification not only proves our methodology is sound, it makes it easier for us to work with larger organizations in the future.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;We pursued this certification for the same reason we open our products to scrutiny through external penetration tests and our &lt;a href=\"https://proton.me/security/bug-bounty\"&gt;bug bounty program&lt;/a&gt;: To ensure any vulnerabilities in our service are swiftly identified and resolved so your information remains safe.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;h2 class=\"wp-block-heading\"&gt;What&amp;#8217;s next&amp;nbsp;&lt;/h2&gt;\n\n\n\n&lt;p&gt;Looking ahead, we plan to strengthen support for our business customers, particularly those handling sensitive data, by publishing further information and audit reports detailing our security controls.&amp;nbsp;&lt;/p&gt;\n\n\n\n&lt;p&gt;Thank you for being part of our mission to build a better internet where privacy is the default. Stay tuned for more updates and new features designed to keep your data safe and secure.&lt;/p&gt;\n   </content:encoded>\n   <category>\n    Proton news\n   </category>\n   <author>\n    Patricia Egger\n   </author>\n  </item>\n </channel>\n</rss>\n"
}